SELECT tbox 'TBOX((1.0, 2000-01-01), (1.0, 2000-01-02))';
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(1,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0,), (1.0,))';
      tbox       
-----------------
 TBOX((1,),(1,))
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
                           tbox                            
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((2,2000-01-02),(1,2000-01-01))';
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

/* Errors */
SELECT tbox 'XXX(1, 2000-01-02)';
ERROR:  Could not parse TBOX
LINE 2: SELECT tbox 'XXX(1, 2000-01-02)';
                    ^
SELECT tbox 'TBOX(1, 2000-01-02)';
ERROR:  Could not parse TBOX: Missing opening parenthesis
LINE 1: SELECT tbox 'TBOX(1, 2000-01-02)';
                    ^
SELECT tbox 'TBOX((,),(,2000-01-01))';
ERROR:  Could not parse TBOX: Both value and time dimensions are empty
LINE 1: SELECT tbox 'TBOX((,),(,2000-01-01))';
                    ^
SELECT tbox 'TBOX((AA, 2000-01-02))';
ERROR:  Invalid input syntax for type double
LINE 1: SELECT tbox 'TBOX((AA, 2000-01-02))';
                    ^
SELECT tbox 'TBOX((1, AA))';
ERROR:  invalid input syntax for type timestamp with time zone: "AA"
LINE 1: SELECT tbox 'TBOX((1, AA))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01, 2))';
ERROR:  Could not parse TBOX: Missing closing parenthesis
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01, 2))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),2, 2000-01-02))';
ERROR:  Could not parse TBOX: Missing opening parenthesis
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),2, 2000-01-02))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),(AA, 2000-01-02))';
ERROR:  Invalid input syntax for type double
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),(AA, 2000-01-02))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),(2, AA))';
ERROR:  invalid input syntax for type timestamp with time zone: "AA"
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),(2, AA))';
                    ^
SELECT tbox 'TBOX((1, 2000-01-01),(2, 2000-01-02)';
ERROR:  Could not parse TBOX: Missing closing parenthesis
LINE 1: SELECT tbox 'TBOX((1, 2000-01-01),(2, 2000-01-02)';
                    ^
COPY tbl_tbox TO '/tmp/tbl_tbox' (FORMAT BINARY);
COPY 100
DROP TABLE IF EXISTS tbl_tbox_tmp;
NOTICE:  table "tbl_tbox_tmp" does not exist, skipping
DROP TABLE
CREATE TABLE tbl_tbox_tmp AS TABLE tbl_tbox WITH NO DATA;
CREATE TABLE AS
COPY tbl_tbox_tmp FROM '/tmp/tbl_tbox' (FORMAT BINARY);
COPY 100
SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox_tmp t2 WHERE t1.k = t2.k AND t1.b <> t2.b;
 count 
-------
     0
(1 row)

DROP TABLE tbl_tbox_tmp;
DROP TABLE
SELECT tbox(1,'2000-01-01',2,'2000-01-02');
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox(2,'2000-01-02',1,'2000-01-01');
                            tbox                             
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox(1,2);
      tbox       
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tbox(2,1);
      tbox       
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tboxt('2000-01-01','2000-01-02');
                           tboxt                           
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tboxt('2000-01-02','2000-01-01');
                           tboxt                           
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))'::floatrange;
 floatrange 
------------
 [1,2]
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))'::period;
                      period                      
--------------------------------------------------
 [2000-01-01 00:00:00+00, 2000-01-02 00:00:00+00]
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0, ))'::floatrange;
 floatrange 
------------
 [1,2]
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0, ))'::period;
 period 
--------
 
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))'::floatrange;
 floatrange 
------------
 
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))'::period;
                      period                      
--------------------------------------------------
 [2000-01-01 00:00:00+00, 2000-01-02 00:00:00+00]
(1 row)

SELECT 1::tbox;
      tbox       
-----------------
 TBOX((1,),(1,))
(1 row)

SELECT 1.5::tbox;
        tbox         
---------------------
 TBOX((1.5,),(1.5,))
(1 row)

SELECT floatrange 'empty'::tbox;
 tbox 
------
 
(1 row)

SELECT floatrange '(,1]'::tbox;
 tbox 
------
 
(1 row)

SELECT floatrange '[1,)'::tbox;
 tbox 
------
 
(1 row)

SELECT floatrange '[1,2]'::tbox;
      tbox       
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tbox(floatrange 'empty', timestamptz '2000-01-01');
 tbox 
------
 
(1 row)

SELECT tbox(floatrange 'empty', period '[2000-01-01,2000-01-02]');
 tbox 
------
 
(1 row)

SELECT ROUND(MAX(upper(b::floatrange) - lower(b::floatrange))::numeric, 6) FROM tbl_tbox;
  round   
----------
 9.798705
(1 row)

SELECT MAX(duration(b::period)) FROM tbl_tbox;
   max    
----------
 00:09:00
(1 row)

SELECT hasX(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
 hasx 
------
 t
(1 row)

SELECT hasX(tbox 'TBOX((1.0,), (2.0, ))');
 hasx 
------
 t
(1 row)

SELECT hasX(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
 hasx 
------
 f
(1 row)

SELECT hasT(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
 hast 
------
 t
(1 row)

SELECT hasT(tbox 'TBOX((1.0,), (2.0, ))');
 hast 
------
 f
(1 row)

SELECT hasT(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
 hast 
------
 t
(1 row)

SELECT Xmin(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
 xmin 
------
    1
(1 row)

SELECT Xmax(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
 xmax 
------
    2
(1 row)

SELECT Tmin(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
          tmin          
------------------------
 2000-01-01 00:00:00+00
(1 row)

SELECT Tmax(tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))');
          tmax          
------------------------
 2000-01-02 00:00:00+00
(1 row)

SELECT Xmin(tbox 'TBOX((1.0,), (2.0, ))');
 xmin 
------
    1
(1 row)

SELECT Xmax(tbox 'TBOX((1.0,), (2.0, ))');
 xmax 
------
    2
(1 row)

SELECT Tmin(tbox 'TBOX((1.0,), (2.0, ))');
 tmin 
------
 
(1 row)

SELECT Tmax(tbox 'TBOX((1.0,), (2.0, ))');
 tmax 
------
 
(1 row)

SELECT Xmin(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
 xmin 
------
     
(1 row)

SELECT Xmax(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
 xmax 
------
     
(1 row)

SELECT Tmin(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
          tmin          
------------------------
 2000-01-01 00:00:00+00
(1 row)

SELECT Tmax(tbox 'TBOX((, 2000-01-01), (, 2000-01-02))');
          tmax          
------------------------
 2000-01-02 00:00:00+00
(1 row)

SELECT MIN(xmin(b)) FROM tbl_tbox;
    min     
------------
 0.45479806
(1 row)

SELECT MAX(xmax(b)) FROM tbl_tbox;
    max    
-----------
 108.64587
(1 row)

SELECT MIN(tmin(b)) FROM tbl_tbox;
          min           
------------------------
 2001-01-02 17:00:00+00
(1 row)

SELECT MAX(tmax(b)) FROM tbl_tbox;
          max           
------------------------
 2001-12-23 04:22:00+00
(1 row)

SELECT expandValue(tbox 'TBOX((1,2001-01-01),(2,2001-01-02))', 2);
                         expandvalue                          
--------------------------------------------------------------
 TBOX((-1,2001-01-01 00:00:00+00),(4,2001-01-02 00:00:00+00))
(1 row)

SELECT expandTemporal(tbox 'TBOX((1,2001-01-01),(2,2001-01-02))', interval '1 day');
                       expandtemporal                        
-------------------------------------------------------------
 TBOX((1,2000-12-31 00:00:00+00),(2,2001-01-03 00:00:00+00))
(1 row)

SELECT round(tbox 'TBOX((1.123456789,2001-01-01),(2.123456789,2001-01-02))', 2);
                               round                               
-------------------------------------------------------------------
 TBOX((1.12,2001-01-01 00:00:00+00),(2.12,2001-01-02 00:00:00+00))
(1 row)

/* Errors */
SELECT expandValue(tbox 'TBOX((,2001-01-01),(,2001-01-02))', 2);
ERROR:  The box must have value dimension
SELECT expandTemporal(tbox 'TBOX((1),(2))', interval '1 day');
ERROR:  The box must have time dimension
SELECT round(tbox 'TBOX((,2001-01-01),(,2001-01-02))', 2);
ERROR:  The box must have value dimension
SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' && tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 t
(1 row)

SELECT tbox 'TBOX((1,2001-02-01),(2,2001-01-02))' @> tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 f
(1 row)

SELECT tbox 'TBOX((1,2001-02-01),(2,2001-01-02))' <@ tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 f
(1 row)

SELECT tbox 'TBOX((1,2001-02-01),(2,2001-01-02))' -|- tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 t
(1 row)

SELECT tbox 'TBOX((1,2001-02-01),(2,2001-01-02))' ~= tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 f
(1 row)

SELECT period '[2000-01-01, 2000-01-02]'::tbox -|- period '[2000-01-02, 2000-01-03]'::tbox;
 ?column? 
----------
 t
(1 row)

/* Errors */
SELECT tbox 'TBOX((1),(2))' && tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The temporal values must have at least one common dimension
SELECT tbox 'TBOX((1),(2))' @> tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The temporal values must have at least one common dimension
SELECT tbox 'TBOX((1),(2))' <@ tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The temporal values must have at least one common dimension
SELECT tbox 'TBOX((1),(2))' -|- tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The temporal values must have at least one common dimension
SELECT tbox 'TBOX((1),(2))' ~= tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The temporal values must have at least one common dimension
SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b && t2.b;
 count 
-------
    99
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b @> t2.b;
 count 
-------
    99
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b <@ t2.b;
 count 
-------
    99
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b -|- t2.b;
 count 
-------
     0
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b ~= t2.b;
 count 
-------
    99
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' << tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 f
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' &< tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 t
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' >> tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 f
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' &> tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 t
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' <<# tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 f
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' &<# tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 t
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' #>> tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 f
(1 row)

SELECT tbox 'TBOX((1,2001-01-01),(2,2001-01-02))' #&> tbox 'TBOX((1,2001-01-01),(2,2001-01-02))';
 ?column? 
----------
 t
(1 row)

/* Errors */
SELECT tbox 'TBOX((1),(2))' << tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have value dimension
SELECT tbox 'TBOX((1),(2))' &< tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have value dimension
SELECT tbox 'TBOX((1),(2))' >> tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have value dimension
SELECT tbox 'TBOX((1),(2))' &> tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have value dimension
SELECT tbox 'TBOX((1),(2))' <<# tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have time dimension
SELECT tbox 'TBOX((1),(2))' &<# tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have time dimension
SELECT tbox 'TBOX((1),(2))' #>> tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have time dimension
SELECT tbox 'TBOX((1),(2))' #&> tbox 'TBOX((,2001-01-01),(,2001-01-02))';
ERROR:  The box must have time dimension
SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b << t2.b;
 count 
-------
  4341
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b &< t2.b;
 count 
-------
  4950
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b >> t2.b;
 count 
-------
  4341
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b &> t2.b;
 count 
-------
  4950
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b <<# t2.b;
 count 
-------
  4851
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b &<# t2.b;
 count 
-------
  4950
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b #>> t2.b;
 count 
-------
  4851
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b #&> t2.b;
 count 
-------
  4950
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' + tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))';
                          ?column?                           
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' + tbox 'TBOX((1.0,), (2.0,))';
ERROR:  The boxes must be of the same dimensionality
SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' + tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
ERROR:  The boxes must be of the same dimensionality
SELECT tbox 'TBOX((1.0,), (2.0,))' + tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))';
ERROR:  The boxes must be of the same dimensionality
SELECT tbox 'TBOX((1.0,), (2.0,))' + tbox 'TBOX((1.0,), (2.0,))';
    ?column?     
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0,))' + tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
ERROR:  The boxes must be of the same dimensionality
SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))' + tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))';
ERROR:  The boxes must be of the same dimensionality
SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))' + tbox 'TBOX((1.0,), (2.0,))';
ERROR:  The boxes must be of the same dimensionality
SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))' + tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
                         ?column?                          
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' + tbox 'TBOX((11.0, 2000-01-01), (12.0, 2000-01-02))';
ERROR:  Result of box union would not be contiguous
SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' + tbox 'TBOX((1.0, 2000-02-01), (2.0, 2000-02-02))';
ERROR:  Result of box union would not be contiguous
/* Errors */
SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' + tbox 'TBOX((3.0, 2000-01-01), (4.0, 2000-01-02))';
ERROR:  Result of box union would not be contiguous
SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' + tbox 'TBOX((1.0, 2000-01-03), (2.0, 2000-01-04))';
ERROR:  Result of box union would not be contiguous
SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' * tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))';
                          ?column?                           
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(2,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' * tbox 'TBOX((1.0,), (2.0,))';
    ?column?     
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' * tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
                         ?column?                          
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0,))' * tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))';
    ?column?     
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0,))' * tbox 'TBOX((1.0,), (2.0,))';
    ?column?     
-----------------
 TBOX((1,),(2,))
(1 row)

SELECT tbox 'TBOX((1.0,), (2.0,))' * tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
 ?column? 
----------
 
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))' * tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))';
                         ?column?                          
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))' * tbox 'TBOX((1.0,), (2.0,))';
 ?column? 
----------
 
(1 row)

SELECT tbox 'TBOX((, 2000-01-01), (, 2000-01-02))' * tbox 'TBOX((, 2000-01-01), (, 2000-01-02))';
                         ?column?                          
-----------------------------------------------------------
 TBOX((,2000-01-01 00:00:00+00),(,2000-01-02 00:00:00+00))
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' * tbox 'TBOX((11.0, 2000-01-01), (12.0, 2000-01-02))';
 ?column? 
----------
 
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-01), (2.0, 2000-01-02))' * tbox 'TBOX((1.0, 2000-02-01), (2.0, 2000-02-02))';
 ?column? 
----------
 
(1 row)

SELECT MAX(xmax(t1.b + t2.b)) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b && t2.b;
    max    
-----------
 108.64587
(1 row)

SELECT MAX(xmax(t1.b * t2.b)) FROM tbl_tbox t1, tbl_tbox t2;
    max    
-----------
 108.64587
(1 row)

WITH test(box) AS (
  SELECT NULL::tbox UNION ALL SELECT tbox 'TBOX((1, 2000-01-01),(2, 2000-01-02))' UNION ALL
  SELECT NULL::tbox UNION ALL SELECT tbox 'TBOX((1, 2000-01-01),(3, 2000-01-03))' )
SELECT extent(box) FROM test;
                           extent                            
-------------------------------------------------------------
 TBOX((1,2000-01-01 00:00:00+00),(3,2000-01-03 00:00:00+00))
(1 row)

set parallel_setup_cost=0;
SET
set parallel_tuple_cost=0;
SET
set min_parallel_table_scan_size=0;
SET
set max_parallel_workers_per_gather=2;
SET
SELECT round(extent(temp::tbox),6) FROM tbl_tfloat_big;
                                    round                                    
-----------------------------------------------------------------------------
 TBOX((1.004155,2000-12-31 23:36:00+00),(100.999349,2001-12-31 02:50:00+00))
(1 row)

reset parallel_setup_cost;
RESET
reset parallel_tuple_cost;
RESET
reset min_parallel_table_scan_size;
RESET
reset max_parallel_workers_per_gather;
RESET
SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((2.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((2.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-03), (1.0, 2000-01-02))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-03), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (2.0, 2000-01-02))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (2.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-03))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-03))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))', tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))');
 tbox_cmp 
----------
        0
(1 row)

SELECT tbox_cmp('TBOX((1,),(2,))', 'TBOX((1,2001-01-01),(2,2001-01-02))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp('TBOX((1,2001-01-01),(2,2001-01-02))', 'TBOX((1,),(2,))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox 'TBOX((1.0, 2000-01-02), (1.0, 2000-01-02))' = floatrange '[1, 2]'::tbox;
 ?column? 
----------
 f
(1 row)

SELECT tbox_cmp(t1.b, t2.b), COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 GROUP BY tbox_cmp(t1.b, t2.b) ORDER BY 1;
 tbox_cmp | count 
----------+-------
       -1 |  4851
        0 |    99
        1 |  4851
          |   199
(4 rows)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b = t2.b;
 count 
-------
    99
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b <> t2.b;
 count 
-------
  9702
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b < t2.b;
 count 
-------
  4851
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b <= t2.b;
 count 
-------
  4950
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b > t2.b;
 count 
-------
  4851
(1 row)

SELECT COUNT(*) FROM tbl_tbox t1, tbl_tbox t2 WHERE t1.b >= t2.b;
 count 
-------
  4950
(1 row)

