Repository: MobilityDB/MobilityDB
Catalog: doc/*/data_generator.po
Languages: es

source: CREATE TABLE tbl_tbox AS /* Add perc NULL values */ SELECT k, NULL AS b FROM generate_series(1, perc) AS k UNION SELECT k, random_tbox(0, 100, '2001-01-01', '2001-12-31', 10, 10) FROM generate_series(perc+1, size) AS k;
es: CREATE TABLE tbl_tbox AS /* Add perc NULL valores */ SELECT k, NULL AS b FROM generate_series(1, perc) AS k UNION SELECT k, random_tbox(0, 100, '2001-01-01', '2001-12-31', 10, 10) FROM generate_series(perc+1, size) AS k;

source: The creation of a table <varname>tbl_floatrange</varname> containing random <varname>floatrange</varname> values where the bounds for values are in the range [0,100] and the maximum difference between the lower and the upper bounds is 10 is given next.
es: La creación de una tabla <varname>tbl_floatrange</varname> que contiene valores aleatorios <varname>floatrange</varname> donde los límites de los valores están en el rango [0,100] y la máxima diferencia entre los límites inferiores y superiores es 10 se da a continuación.

source: CREATE TABLE tbl_floatrange AS /* Add perc NULL values */ SELECT k, NULL AS f FROM generate_series(1, perc) AS k UNION SELECT k, random_floatrange(0, 100, 10) FROM generate_series(perc+1, size) AS k;
es: CREATE TABLE tbl_floatrango AS /* Add perc NULL valores */ SELECT k, NULL AS f FROM generate_series(1, perc) AS k UNION SELECT k, random_floatrango(0, 100, 10) FROM generate_series(perc+1, size) AS k;

source: The creation of a table <varname>tbl_timestampset</varname> containing random <varname>timestampset</varname> values having between 5 and 10 timestamps where the timestamps are in the range [2001-01-01, 2001-12-31] and the maximum interval between consecutive timestamps is 10 minutes is given next.
es: La creación de una tabla <varname>tbl_timestampset</varname> que contiene valores aleatorios <varname>timestampset</varname> que tienen entre 5 y 10 marcas de tiempo donde las marcas de tiempo están en el rango [2001-01-01, 2001-12-31] y el máximo intervalo entre marcas de tiempo consecutivas es 10 minutos se da a continuación.

source: CREATE TABLE tbl_timestampset AS /* Add perc NULL values */ SELECT k, NULL AS ts FROM generate_series(1, perc) AS k UNION SELECT k, random_timestampset('2001-01-01', '2001-12-31', 10, 5, 10) FROM generate_series(perc+1, size) AS k;
es: CREATE TABLE tbl_timestampset AS /* Add perc NULL valores */ SELECT k, NULL AS ts FROM generate_series(1, perc) AS k UNION SELECT k, random_timestampset('2001-01-01', '2001-12-31', 10, 5, 10) FROM generate_series(perc+1, size) AS k;

source: The creation of a table <varname>tbl_period</varname> containing random <varname>period</varname> values where the timestamps are in the range [2001-01-01, 2001-12-31] and the maximum difference between the lower and the upper bounds is 10 minutes is given next.
es: La creación de una tabla <varname>tbl_period</varname> que contiene valores aleatorios <varname>period</varname> donde las marcas de tiempo están en el rango [2001-01-01, 2001-12-31] y la máxima diferencia entre los límites inferiores y superiores es 10 minutos se da a continuación.

source: CREATE TABLE tbl_period AS /* Add perc NULL values */ SELECT k, NULL AS p FROM generate_series(1, perc) AS k UNION SELECT k, random_period('2001-01-01', '2001-12-31', 10) FROM generate_series(perc+1, size) AS k;
es: CREATE TABLE tbl_period AS /* Add perc NULL valores */ SELECT k, NULL AS p FROM generate_series(1, perc) AS k UNION SELECT k, random_period('2001-01-01', '2001-12-31', 10) FROM generate_series(perc+1, size) AS k;

source: The creation of a table <varname>tbl_geom_point</varname> containing random <varname>geometry</varname> 2D point values, where the x and y coordinates are in the range [0, 100] and in SRID 3812 is given next.
es: La creación de una tabla <varname>tbl_geom_point</varname> que contiene valores aleatorios <varname>geometry</varname> 2D point valores, donde las coordenadas x e y están en el rango [0, 100] y en SRID 3812 se da a continuación.

source: Notice that the table contains an empty point value. If the SRID is not given it is set by default to 0.
es: Observe que la tabla contiene un valor de punto vacío. Si no se proporciona el SRID, se establece de forma predeterminada en 0.

source: The creation of a table <varname>tbl_geog_point3D</varname> containing random <varname>geography</varname> 3D point values, where the x, y, and z coordinates are, respectively, in the ranges [-10, 32], [35, 72], and [0, 1000] and in SRID 7844 is given next.
es: La creación de una tabla <varname>tbl_geog_point3D</varname> que contiene valores aleatorios <varname>geography</varname> 3D point valores, donde las coordenadas x, y, y z están, respectivament, en los rangos [-10, 32], [35, 72] y [0, 1000] y en SRID 7844 se da a continuación.

source: Notice that latitude and longitude values are chosen to approximately cover continental Europe. If the SRID is not given it is set by default to 4326.
es: Tenga en cuenta que los valores de latitud y longitud se eligen para cubrir aproximadamente la Europa continental. Si no se proporciona el SRID, se establece de forma predeterminada en 4326.

source: The creation of a table <varname>tbl_geom_linestring</varname> containing random <varname>geometry</varname> 2D linestring values having between 5 and 10 vertices, where the x and y coordinates are in the range [0, 100] and in SRID 3812 and the maximum difference between consecutive coordinate values is 10 units in the underlying SRID is given next.
es: La creación de una tabla <varname>tbl_geom_linestring</varname> que contiene valores aleatorios <varname>geometry</varname> 2D linestring valores que tienen entre 5 y 10 vértices, donde las coordenadas x e y están en el rango [0, 100] y en SRID 3812 y la máxima diferencia entre valores de coordenadas consecutivos es 10 unidades en el SRID subyacente se da a continuación.

source: The creation of a table <varname>tbl_geom_linestring</varname> containing random <varname>geometry</varname> 2D linestring values having between 5 and 10 vertices, where the x and y coordinates are in the range [0, 100] and the maximum difference between consecutive coordinate values is 10 units in the underlying SRID is given next.
es: La creación de una tabla <varname>tbl_geom_linestring</varname> que contiene valores aleatorios <varname>geometry</varname> 2D linestring valores que tienen entre 5 y 10 vértices, donde las coordenadas x e y están en el rango [0, 100] y la máxima diferencia entre valores de coordenadas consecutivos es 10 unidades en el SRID subyacente se da a continuación.

source: The creation of a table <varname>tbl_geom_polygon3D</varname> containing random <varname>geometry</varname> 3D polygon values without holes, having between 5 and 10 vertices, where the x, y, and z coordinates are in the range [0, 100] and the maximum difference between consecutive coordinate values is 10 units in the underlying SRID is given next.
es: La creación de una tabla <varname>tbl_geom_polygon3D</varname> que contiene valores aleatorios <varname>geometry</varname> 3D polygon valores sin agujeros, que tienen entre 5 y 10 vértices, donde las coordenadas x, y, y z están en el rango [0, 100] y la máxima diferencia entre valores de coordenadas consecutivos es 10 unidades en el SRID subyacente se da a continuación.

source: The creation of a table <varname>tbl_geom_multipoint</varname> containing random <varname>geometry</varname> 2D multipoint values having between 5 and 10 points, where the x and y coordinates are in the range [0, 100] and the maximum difference between consecutive coordinate values is 10 units in the underlying SRID is given next.
es: La creación de una tabla <varname>tbl_geom_multipoint</varname> que contiene valores aleatorios <varname>geometry</varname> 2D multipunto valores que tienen entre 5 y 10 points, donde las coordenadas x e y están en el rango [0, 100] y la máxima diferencia entre valores de coordenadas consecutivos es 10 unidades en el SRID subyacente se da a continuación.

source: CREATE TABLE tbl_geom_multipoint AS SELECT 1 AS k, geometry 'multipoint empty' AS g UNION SELECT k, random_geom_multipoint(0, 100, 0, 100, 10, 5, 10) FROM generate_series(2, size) k;
es: CREATE TABLE tbl_geom_multipoint AS SELECT 1 AS k, geometry 'multipunto empty' AS g UNION SELECT k, random_geom_multipoint(0, 100, 0, 100, 10, 5, 10) FROM generate_series(2, size) k;

source: The creation of a table <varname>tbl_geog_multilinestring</varname> containing random <varname>geography</varname> 2D multilinestring values having between 5 and 10 linestrings, each one having between 5 and 10 vertices, where the x and y coordinates are, respectively, in the ranges [-10, 32] and [35, 72], and the maximum difference between consecutive coordinate values is 10 is given next.
es: La creación de una tabla <varname>tbl_geog_multilinestring</varname> que contiene valores aleatorios <varname>geography</varname> 2D multilinestring valores que tienen entre 5 y 10 linestrings, cada una teniendo entre 5 y 10 vértices, donde las coordenadas x e y estan, respectivamente, en el rangos [-10, 32] y [35, 72] y la máxima diferencia entre valores de coordenadas consecutivos es 10 se da a continuación.

source: The creation of a table <varname>tbl_geometry3D</varname> containing random <varname>geometry</varname> 3D values of various types is given next. This function requires that the tables for the various geometry types have been created previously.
es: La creación de una tabla <varname>tbl_geometry3D</varname> que contiene valores aleatorios <varname>geometry</varname> 3D de varios tipos se da a continuación. Esta función requiere que las tablas para los diversos tipos de geometría se hayan creado previamente.

source: The creation of a table <varname>tbl_tbool_inst</varname> containing random <varname>tbool</varname> values of instant subtype where the timestamps are in the range [2001-01-01, 2001-12-31] is given next.
es: La creación de una tabla <varname>tbl_tbool_inst</varname> que contiene valores aleatorios <varname>tbool</varname> valores de subtipo instante donde las marcas de tiempo están en el rango [2001-01-01, 2001-12-31] se da a continuación.

source: CREATE TABLE tbl_tbool_inst AS /* Add perc NULL values */ SELECT k, NULL AS inst FROM generate_series(1, perc) AS k UNION SELECT k, random_tbool_inst('2001-01-01', '2001-12-31') FROM generate_series(perc+1, size) k; /* Add perc duplicates */ UPDATE tbl_tbool_inst t1 SET inst = (SELECT inst FROM tbl_tbool_inst t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc rows with the same timestamp */ UPDATE tbl_tbool_inst t1 SET inst = (SELECT tboolinst(random_bool(), getTimestamp(inst)) FROM tbl_tbool_inst t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i);
es: CREATE TABLE tbl_tbool_inst AS /* Add perc NULL valores */ SELECT k, NULL AS inst FROM generate_series(1, perc) AS k UNION SELECT k, random_tbool_inst('2001-01-01', '2001-12-31') FROM generate_series(perc+1, size) k; /* Add perc duplicates */ UPDATE tbl_tbool_inst t1 SET inst = (SELECT inst FROM tbl_tbool_inst t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc rows con the same timestamp */ UPDATE tbl_tbool_inst t1 SET inst = (SELECT tboolinst(random_bool(), getTimestamp(inst)) FROM tbl_tbool_inst t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i);

source: As can be seen above, the table has a percentage of null values, of duplicates, and of rows with the same timestamp.
es: Como se puede ver arriba, la tabla tiene un porcentaje de valores nulos, de duplicados y de filas con la misma marca de tiempo.

source: The creation of a table <varname>tbl_tint_instset</varname> containing random <varname>tint</varname> values of instant set subtype having between 5 and 10 timestamps where the integer values are in the range [0, 100], the timestamps are in the range [2001-01-01, 2001-12-31], the maximum difference between two consecutive values is 10, and the maximum interval between two consecutive instants is 10 minutes is given next.
es: La creación de una tabla <varname>tbl_tint_instset</varname> que contiene valores aleatorios <varname>tint</varname> valores de subtipo conjunto de instantes que tienen entre 5 y 10 marcas de tiempo donde the integer valores están en el rango [0, 100], las marcas de tiempo están en el rango [2001-01-01, 2001-12-31], la máxima diferencia entre dos valores consecutivos es 10 y el máximo intervalo entre dos instantes consecutivos es 10 minutos se da a continuación.

source: CREATE TABLE tbl_tint_instset AS /* Add perc NULL values */ SELECT k, NULL AS ti FROM generate_series(1, perc) AS k UNION SELECT k, random_tint_instset(0, 100, '2001-01-01', '2001-12-31', 10, 10, 5, 10) AS ti FROM generate_series(perc+1, size) k; /* Add perc duplicates */ UPDATE tbl_tint_instset t1 SET ti = (SELECT ti FROM tbl_tint_instset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc rows with the same timestamp */ UPDATE tbl_tint_instset t1 SET ti = (SELECT ti + random_int(1, 2) FROM tbl_tint_instset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc rows that meet */ UPDATE tbl_tint_instset t1 SET ti = (SELECT shift(ti, endTimestamp(ti)-startTimestamp(ti)) FROM tbl_tint_instset t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i); /* Add perc rows that overlap */ UPDATE tbl_tint_instset t1 SET ti = (SELECT shift(ti, date_trunc('minute',(endTimestamp(ti)-startTimestamp(ti))/2)) FROM tbl_tint_instset t2 WHERE t2.k = t1.k+2) WHERE t1.k in (SELECT i FROM generate_series(1 + 8*perc, 9*perc) i);
es: CREATE TABLE tbl_tint_instset AS /* Add perc NULL valores */ SELECT k, NULL AS ti FROM generate_series(1, perc) AS k UNION SELECT k, random_tint_instset(0, 100, '2001-01-01', '2001-12-31', 10, 10, 5, 10) AS ti FROM generate_series(perc+1, size) k; /* Add perc duplicates */ UPDATE tbl_tint_instset t1 SET ti = (SELECT ti FROM tbl_tint_instset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc rows con the same timestamp */ UPDATE tbl_tint_instset t1 SET ti = (SELECT ti + random_int(1, 2) FROM tbl_tint_instset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc rows that meet */ UPDATE tbl_tint_instset t1 SET ti = (SELECT shift(ti, endTimestamp(ti)-startTimestamp(ti)) FROM tbl_tint_instset t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i); /* Add perc rows that overlap */ UPDATE tbl_tint_instset t1 SET ti = (SELECT shift(ti, date_trunc('minute',(endTimestamp(ti)-startTimestamp(ti))/2)) FROM tbl_tint_instset t2 WHERE t2.k = t1.k+2) WHERE t1.k in (SELECT i FROM generate_series(1 + 8*perc, 9*perc) i);

source: As can be seen above, the table has a percentage of null values, of duplicates, of rows with the same timestamp, of rows that meet, and of rows that overlap.
es: Como se puede ver arriba, la tabla tiene un porcentaje de valores nulos, de duplicados, de filas con la misma marca de tiempo, de filas que se encuentran y de filas que se superponen.

source: The creation of a table <varname>tbl_tfloat_seq</varname> containing random <varname>tfloat</varname> values of sequence subtype having between 5 and 10 timestamps where the float values are in the range [0, 100], the timestamps are in the range [2001-01-01, 2001-12-31], the maximum difference between two consecutive values is 10, and the maximum interval between two consecutive instants is 10 minutes is given next.
es: La creación de una tabla <varname>tbl_tfloat_seq</varname> que contiene valores aleatorios <varname>tfloat</varname> valores de subtipo secuencia que tienen entre 5 y 10 marcas de tiempo donde the float valores están en el rango [0, 100], las marcas de tiempo están en el rango [2001-01-01, 2001-12-31], la máxima diferencia entre dos valores consecutivos es 10 y el máximo intervalo entre dos instantes consecutivos es 10 minutos se da a continuación.

source: CREATE TABLE tbl_tfloat_seq AS /* Add perc NULL values */ SELECT k, NULL AS seq FROM generate_series(1, perc) AS k UNION SELECT k, random_tfloat_seq(0, 100, '2001-01-01', '2001-12-31', 10, 10, 5, 10) AS seq FROM generate_series(perc+1, size) k; /* Add perc duplicates */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT seq FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc tuples with the same timestamp */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT seq + random_int(1, 2) FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc tuples that meet */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT shift(seq, timespan(seq)) FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i); /* Add perc tuples that overlap */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT shift(seq, date_trunc('minute',timespan(seq)/2)) FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 8*perc, 9*perc) i);
es: CREATE TABLE tbl_tfloat_seq AS /* Add perc NULL valores */ SELECT k, NULL AS seq FROM generate_series(1, perc) AS k UNION SELECT k, random_tfloat_seq(0, 100, '2001-01-01', '2001-12-31', 10, 10, 5, 10) AS seq FROM generate_series(perc+1, size) k; /* Add perc duplicates */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT seq FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc tuples con the same timestamp */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT seq + random_int(1, 2) FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc tuples that meet */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT shift(seq, timespan(seq)) FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i); /* Add perc tuples that overlap */ UPDATE tbl_tfloat_seq t1 SET seq = (SELECT shift(seq, date_trunc('minute',timespan(seq)/2)) FROM tbl_tfloat_seq t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 8*perc, 9*perc) i);

source: The creation of a table <varname>tbl_ttext_seqset</varname> containing random <varname>ttext</varname> values of sequence set subtype having between 5 and 10 sequences, each one having between 5 and 10 timestamps, where the text values have at most 10 characters, the timestamps are in the range [2001-01-01, 2001-12-31], and the maximum interval between two consecutive instants is 10 minutes is given next.
es: La creación de una tabla <varname>tbl_ttext_seqset</varname> que contiene valores aleatorios <varname>ttext</varname> de subtipo conjunto de secuencias que tienen entre 5 y 10 sequences, cada una teniendo entre 5 y 10 marcas de tiempo, donde los valores de texto tienen máximo 10 caracteres, las marcas de tiempo están en el rango [2001-01-01, 2001-12-31] y el máximo intervalo entre dos instantes consecutivos es 10 minutos se da a continuación.

source: CREATE TABLE tbl_ttext_seqset AS /* Add perc NULL values */ SELECT k, NULL AS ts FROM generate_series(1, perc) AS k UNION SELECT k, random_ttext_seqset('2001-01-01', '2001-12-31', 10, 10, 5, 10, 5, 10) AS ts FROM generate_series(perc+1, size) AS k; /* Add perc duplicates */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT ts FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc tuples with the same timestamp */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT ts || text 'A' FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc tuples that meet */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT shift(ts, timespan(ts)) FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i); /* Add perc tuples that overlap */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT shift(ts, date_trunc('minute', timespan(ts)/2)) FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 8*perc, 9*perc) i);
es: CREATE TABLE tbl_ttext_seqset AS /* Add perc NULL valores */ SELECT k, NULL AS ts FROM generate_series(1, perc) AS k UNION SELECT k, random_ttext_seqset('2001-01-01', '2001-12-31', 10, 10, 5, 10, 5, 10) AS ts FROM generate_series(perc+1, size) AS k; /* Add perc duplicates */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT ts FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc tuples con the same timestamp */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT ts || text 'A' FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE k in (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc tuples that meet */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT shift(ts, timespan(ts)) FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i); /* Add perc tuples that overlap */ UPDATE tbl_ttext_seqset t1 SET ts = (SELECT shift(ts, date_trunc('minute', timespan(ts)/2)) FROM tbl_ttext_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k in (SELECT i FROM generate_series(1 + 8*perc, 9*perc) i);

source: The creation of a table <varname>tbl_tgeompoint_instset</varname> containing random <varname>tgeompoint</varname> 2D values of instant set subtype having between 5 and 10 instants, where the x and y coordinates are in the range [0, 100] and in SRID 3812, the timestamps are in the range [2001-01-01, 2001-12-31], the maximum difference between successive coordinates is at most 10 units in the underlying SRID, and the maximum interval between two consecutive instants is 10 minutes is given next.
es: La creación de una tabla <varname>tbl_tgeompoint_instset</varname> que contiene valores aleatorios <varname>tgeompoint</varname> 2D valores de subtipo conjunto de instantes que tienen entre 5 y 10 instantes, donde the x e y coordenadas están en el rango [0, 100] y en SRID 3812, las marcas de tiempo están en el rango [2001-01-01, 2001-12-31], la máxima diferencia entre coordenadas successivas máximo 10 unidades en el SRID subyacente y el máximo intervalo entre dos instantes consecutivos es 10 minutos se da a continuación.

source: Finally, the creation of a table <varname>tbl_tgeompoint3D_seqset</varname> containing random <varname>tgeompoint</varname> 3D values of sequence set subtype having between 5 and 10 sequences, each one having between 5 and 10 timestamps, where the x, y, and z coordinates are in the range [0, 100] and in SRID 3812, the timestamps are in the range [2001-01-01, 2001-12-31], the maximum difference between successive coordinates is at most 10 units in the underlying SRID, and the maximum interval between two consecutive instants is 10 minutes is given next.
es: Finally, la creación de una tabla <varname>tbl_tgeompoint3D_seqset</varname> que contiene valores aleatorios <varname>tgeompoint</varname> 3D valores de subtipo conjunto de secuencias que tienen entre 5 y 10 sequences, cada una teniendo entre 5 y 10 marcas de tiempo, donde las coordenadas x, y, y z están en el rango [0, 100] y en SRID 3812, las marcas de tiempo están en el rango [2001-01-01, 2001-12-31], la máxima diferencia entre coordenadas successivas máximo 10 unidades en el SRID subyacente y el máximo intervalo entre dos instantes consecutivos es 10 minutos se da a continuación.
