Repository: MobilityDB/MobilityDB
Catalog: doc/*/data_generator.po
Languages: es

source: DROP TABLE IF EXISTS tbl_tgeompoint3D_seqset; CREATE TABLE tbl_tgeompoint3D_seqset AS SELECT k, random_tgeompoint3D_seqset(0, 100, 0, 100, 0, 100, '2001-01-01', '2001-12-31', 10, 10, 5, 10, 5, 10, 3812) AS ts FROM generate_series(1, size) AS k; /* Add perc duplicates */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT ts FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE k IN (SELECT i FROM generate_series(1, perc) i); /* Add perc tuples with the same timestamp */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT setPrecision(ts,3) FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE k IN (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc tuples that meet */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT shift(ts, timespan(ts)) FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k IN (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc tuples that overlap */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT shift(ts, date_trunc('minute', timespan(ts)/2)) FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k IN (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i);
es: DROP TABLE IF EXISTS tbl_tgeompoint3D_seqset; CREATE TABLE tbl_tgeompoint3D_seqset AS SELECT k, random_tgeompoint3D_seqset(0, 100, 0, 100, 0, 100, '2001-01-01', '2001-12-31', 10, 10, 5, 10, 5, 10, 3812) AS ts FROM generate_series(1, size) AS k; /* Add perc duplicates */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT ts FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE k IN (SELECT i FROM generate_series(1, perc) i); /* Add perc tuples con the same timestamp */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT setPrecision(ts,3) FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE k IN (SELECT i FROM generate_series(1 + 2*perc, 3*perc) i); /* Add perc tuples that meet */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT shift(ts, timespan(ts)) FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k IN (SELECT i FROM generate_series(1 + 4*perc, 5*perc) i); /* Add perc tuples that overlap */ UPDATE tbl_tgeompoint3D_seqset t1 SET ts = (SELECT shift(ts, date_trunc('minute', timespan(ts)/2)) FROM tbl_tgeompoint3D_seqset t2 WHERE t2.k = t1.k+perc) WHERE t1.k IN (SELECT i FROM generate_series(1 + 6*perc, 7*perc) i);

source: Generator for Temporal Network Point Types
es: Generador para tipos de red temporales

source: <varname>random_fraction</varname>: Generate a random fraction in the range [0,1]
es: <varname>random_fraction</varname>: Generar una fracción aleatoria en el rango [0,1]

source: <varname>random_npoint</varname>: Generate a random network point
es: <varname>random_npoint</varname>: Genera un punto de red aleatorio

source: <varname>random_nsegment</varname>: Generate a random network segment
es: <varname>random_nsegment</varname>: Genera un segmento de red aleatorio

source: <varname>random_tnpoint_inst</varname>: Generate a random temporal network point of instant subtype
es: <varname>random_tnpoint_inst</varname>: Generar un punto de red temporal de subtipo instant aleatorio

source: <varname>random_tnpoint_instset</varname>: Generate a random temporal network point of instant set subtype
es: <varname>random_tnpoint_instset</varname>: Generar un punto de red temporal de subtipo conjunto de instantes aleatorio

source: <varname>random_tnpoint_seq</varname>: Generate a random temporal network point of sequence subtype
es: <varname>random_tnpoint_seq</varname>: Generar un punto de red temporal de subtipo secuencia aleatorio

source: <varname>random_tnpoint_seqset</varname>: Generate a random temporal network point of sequence set subtype
es: <varname>random_tnpoint_seqset</varname>: Generar un punto de red temporal de subtipo conjunto de secuencias aleatorio
