Repository: MobilityDB/MobilityDB
Catalog: doc/*/data_generator.po
Languages: es

source: Synthetic Data Generator
es: Generador de datos sintéticos

source: In many circumstances, it is necessary to have a test dataset to evaluate alternative implementation approaches or to perform benchmarks. It is often required that such a data set have particular requirements in size or in the intrinsic characteristics of its data. Even if a real-world dataset could be available, it may be not ideal for such experiments for multiple reasons. Therefore, a synthetic data generator that could be customized to produce data according to the given requirements is often the best solution. Obviously, experiments with synthetic data should be complemented with experiments with real-world data to have a thorough understanding of the problem at hand.
es: En muchas circunstancias, es necesario tener un conjunto de datos de prueba para evaluar enfoques de implementación alternativos o realizar evaluaciones comparativas. A menudo se requiere que tal conjunto de datos tenga requisitos particulares en tamaño o en las características intrínsecas de sus datos. Incluso si un conjunto de datos del mundo real pudiera estar disponible, puede que no sea ideal para tales experimentos por múltiples razones. Por lo tanto, un generador de datos sintéticos que pueda personalizarse para producir datos de acuerdo con los requisitos dados suele ser la mejor solución. Obviamente, los experimentos con datos sintéticos deben complementarse con experimentos con datos del mundo real para tener una comprensión profunda del problema en cuestión.

source: MobilityDB provides a simple synthetic data generator that can be used for such purposes. In particular, such a data generator was used for generating the database used for the regression tests in MobilityDB. The data generator is programmed in PL/pgSQL so it can be easily customized. It is located in the directory <ulink url="https://github.com/MobilityDB/MobilityDB/datagen">datagen</ulink> in the github repository. In this appendix, we briefly introduce the basic functionality of the generator. We first list the functions generating random values for the various PostgreSQL, PostGIS, and MobilityDB data types, and then give examples how to use these functions for generating tables of such values. The parameters of the functions are not specified, please refer to the source files where detailed explanations about the various parameters can be found.
es: MobilityDB proporciona un generador simple de datos sintéticos que se puede utilizar para tales fines. En particular, se utilizó este generador de datos para generar la base de datos utilizada para las pruebas de regresión en MobilityDB. El generador de datos está programado en PL/pgSQL para que se pueda personalizar fácilmente. Se encuentra en el directorio <ulink url="https://github.com/MobilityDB/MobilityDB/datagen">datagen</ulink> en el repositorio de github. En este apéndice, presentamos brevemente la funcionalidad básica del generador. Primero enumeramos las funciones que generan valores aleatorios para varios tipos de datos de PostgreSQL, PostGIS y MobilityDB y luego damos ejemplos de cómo se usan estas funciones para generar tablas de dichos valores. Los parámetros de las funciones no están especificados, consulte los archivos fuente donde se pueden encontrar explicaciones detalladas sobre los distintos parámetros.

source: Generator for PostgreSQL Types
es: Generador para tipos PostgreSQL

source: <varname>random_bool</varname>: Generate a random boolean
es: <varname>random_bool</varname>: Generar un booleano aleatorio

source: <varname>random_int</varname>: Generate a random integer
es: <varname>random_int</varname>: Generar un entero aleatorio

source: <varname>random_int_array</varname>: Generate a random array of integers
es: <varname>random_int_array</varname>: Generar una matriz de enteros aleatorios

source: <varname>random_intrange</varname>: Generate a random integer range
es: <varname>random_intrango</varname>: Generar un rango aleatorio de enteros

source: <varname>random_float</varname>: Generate a random float
es: <varname>random_float</varname>: Generar un número flotante aleatorio

source: <varname>random_float_array</varname>: Generate a random array of floats
es: <varname>random_float_array</varname>: Generar una matriz de números flotantes aleatorios

source: <varname>random_floatrange</varname>: Generate a random float range
es: <varname>random_floatrango</varname>: Generar un rango aleatorio de números flotantes

source: <varname>random_text</varname>: Generate a random text
es: <varname>random_text</varname>: Generar un texto aleatorio

source: <varname>random_timestamptz</varname>: Generate a random timestamp with time zone
es: <varname>random_timestamptz</varname>: Generar una marca de tiempo con zona horaria aleatoria

source: <varname>random_timestamptz_array</varname>: Generate a random array of timestamps with time zone
es: <varname>random_timestamptz_array</varname>: Generar una matriz de marcas de tiempo con zona horaria aleatorias

source: <varname>random_minutes</varname>: Generate a random interval of minutes
es: <varname>random_minutos</varname>: Generar un intervalo de minutos aleatorio

source: <varname>random_tstzrange</varname>: Generate a random timestamp with time zone range
es: <varname>random_tstzrange</varname>: Generar rango aleatorio de marcas de tiempo con zona horaria

source: <varname>random_tstzrange_array</varname>: Generate a random array of timestamp with time zone ranges
es: <varname>random_tstzrango_array</varname>: Generar una matriz de rangos aleatorios de marcas de tiempo con zona horaria

source: Generator for PostGIS Types
es: Generador para tipos PostGIS

source: <varname>random_geom_point</varname>: Generate a random 2D geometric point
es: <varname>random_geom_point</varname>: Generar un punto geométrico 2D aleatorio

source: <varname>random_geom_point3D</varname>: Generate a random 3D geometric point
es: <varname>random_geom_point3D</varname>: Generar un punto geométrico 3D aleatorio

source: <varname>random_geog_point</varname>: Generate a random 2D geographic point
es: <varname>random_geog_point</varname>: Generar un punto geográfico 2D aleatorio

source: <varname>random_geog_point3D</varname>: Generate a random 3D geographic point
es: <varname>random_geog_point3D</varname>: Generar un punto geográfico 3D aleatorio

source: <varname>random_geom_point_array</varname>: Generate a random array of 2D geometric points
es: <varname>random_geom_point_array</varname>: Generar una matriz de puntos geométricos 2D aleatorios

source: <varname>random_geom_point3D_array</varname>: Generate a random array of 3D geometric points
es: <varname>random_geom_point3D_array</varname>: Generar una matriz de puntos geométricos 3D aleatorios

source: <varname>random_geog_point_array</varname>: Generate a random array of 2D geographic points
es: <varname>random_geog_point_array</varname>: Generar una matriz puntos geográficos 2D aleatorios

source: <varname>random_geog_point3D_array</varname>: Generate a random array of 3D geographic points
es: <varname>random_geog_point3D_array</varname>: Generar una matriz de puntos geográficos 3D aleatorios

source: <varname>random_geom_linestring</varname>: Generate a random geometric 2D linestring
es: <varname>random_geom_linestring</varname>: Generar una cadena lineal geométrica 2D aleatoria

source: <varname>random_geom_linestring3D</varname>: Generate a random geometric 3D linestring
es: <varname>random_geom_linestring3D</varname>: Generar una cadena lineal geométrica 3D aleatoria

source: <varname>random_geog_linestring</varname>: Generate a random geographic 2D linestring
es: <varname>random_geog_linestring</varname>: Generar una cadena lineal geográfica 2D aleatoria

source: <varname>random_geog_linestring3D</varname>: Generate a random geographic 3D linestring
es: <varname>random_geog_linestring3D</varname>: Generar una cadena lineal geográfica 3D aleatoria

source: <varname>random_geom_polygon</varname>: Generate a random geometric 2D polygon without holes
es: <varname>random_geom_polygon</varname>: Generar un polígono geométrico 2D sin agujeros aleatorio

source: <varname>random_geom_polygon3D</varname>: Generate a random geometric 3D polygon without holes
es: <varname>random_geom_polygon3D</varname>: Generar un polígono geométrico 3D sin agujeros aleatorio

source: <varname>random_geog_polygon</varname>: Generate a random geographic 2D polygon without holes
es: <varname>random_geog_polygon</varname>: Generar un polígono geográfico 2D sin agujeros aleatorio

source: <varname>random_geog_polygon3D</varname>: Generate a random geographic 3D polygon without holes
es: <varname>random_geog_polygon3D</varname>: Generar un polígono geográfico 3D sin agujeros aleatorio

source: <varname>random_geom_multipoint</varname>: Generate a random geometric 2D multipoint
es: <varname>random_geom_multipoint</varname>: Generar un multipunto geométrico 2D aleatorio

source: <varname>random_geom_multipoint3D</varname>: Generate a random geometric 3D multipoint
es: <varname>random_geom_multipoint3D</varname>: Generar un multipunto geométrico 3D aleatorio

source: <varname>random_geog_multipoint</varname>: Generate a random geographic 2D multipoint
es: <varname>random_geog_multipoint</varname>: Generar un multipunto geográfico 2D aleatorio

source: <varname>random_geog_multipoint3D</varname>: Generate a random geographic 3D multipoint
es: <varname>random_geog_multipoint3D</varname>: Generar un multipunto geográfico 3D aleatorio

source: <varname>random_geom_multilinestring</varname>: Generate a random geometric 2D multilinestring
es: <varname>random_geom_multilinestring</varname>: Generar una multicadena lineal geométrica 2D aleatoria

source: <varname>random_geom_multilinestring3D</varname>: Generate a random geometric 3D multilinestring
es: <varname>random_geom_multilinestring3D</varname>: Generar una multicadena lineal geométrica 3D aleatoria

source: <varname>random_geog_multilinestring</varname>: Generate a random geographic 2D multilinestring
es: <varname>random_geog_multilinestring</varname>: Generar una multicadena lineal geográfica 2D aleatoria

source: <varname>random_geog_multilinestring3D</varname>: Generate a random geographic 3D multilinestring
es: <varname>random_geog_multilinestring3D</varname>: Generar una multicadena lineal geográfica 3D aleatoria

source: <varname>random_geom_multipolygon</varname>: Generate a random geometric 2D multipolygon without holes
es: <varname>random_geom_multipolygon</varname>: Generar un multipolígono geométrico 2D sin agujeros aleatorio

source: <varname>random_geom_multipolygon3D</varname>: Generate a random geometric 3D multipolygon without holes
es: <varname>random_geom_multipolygon3D</varname>: Generar un multipolígono geométrico 3D sin agujeros aleatorio

source: <varname>random_geog_multipolygon</varname>: Generate a random geographic 2D multipolygon without holes
es: <varname>random_geog_multipolygon</varname>: Generar un multipolígono geográfico 2D sin agujeros aleatorio

source: <varname>random_geog_multipolygon3D</varname>: Generate a random geographic 3D multipolygon without holes
es: <varname>random_geog_multipolygon3D</varname>: Generar un multipolígono geográfico 3D sin agujeros aleatorio

source: Generator for MobilityDB Time and Box Types
es: Generador para tipos de tiempo y de cuadro delimitador MobilityDB

source: <varname>random_timestampset</varname>: Generate a random <varname>timestampset</varname>
es: <varname>random_timestampset</varname>: Generar un <varname>timestampset</varname> aleatorio

source: <varname>random_period</varname>: Generate a random <varname>period</varname>
es: <varname>random_period</varname>: Generar un <varname>period</varname> aleatorio

source: <varname>random_period_array</varname>: Generate a random array of <varname>period</varname> values
es: <varname>random_period_array</varname>: Generar una matriz de valores <varname>period</varname> aleatorios

source: <varname>random_periodset</varname>: Generate a random <varname>periodset</varname>
es: <varname>random_periodset</varname>: Generar un <varname>periodset</varname> aleatorio

source: <varname>random_tbox</varname>: Generate a random <varname>tbox</varname>
es: <varname>random_tbox</varname>: Generar un <varname>tbox</varname> aleatorio

source: <varname>random_stbox</varname>: Generate a random 2D <varname>stbox</varname>
es: <varname>random_stbox</varname>: Generar un <varname>stbox</varname> 2D aleatorio

source: <varname>random_stbox3D</varname>: Generate a random 3D <varname>stbox</varname>
es: <varname>random_stbox3D</varname>: Generar un <varname>stbox</varname> 3D aleatorio

source: <varname>random_geodstbox</varname>: Generate a random 2D geodetic <varname>stbox</varname>
es: <varname>random_geodstbox</varname>: Generar un <varname>stbox</varname> geodético 2D aleatorio

source: <varname>random_geodstbox3D</varname>: Generate a random 3D geodetic <varname>stbox</varname>
es: <varname>random_geodstbox3D</varname>: Generar un <varname>stbox</varname> geodético 3D aleatorio

source: Generator for MobilityDB Temporal Types
es: Generador para tipos temporales MobilityDB

source: <varname>random_tbool_inst</varname>: Generate a random temporal Boolean of instant subtype
es: <varname>random_tbool_inst</varname>: Generar un booleano temporal de subtipo instante aleatorio

source: <varname>random_tint_inst</varname>: Generate a random temporal integer of instant subtype
es: <varname>random_tint_inst</varname>: Generar un entero temporal de subtipo instante aleatorio

source: <varname>random_tfloat_inst</varname>: Generate a random temporal float of instant subtype
es: <varname>random_tfloat_inst</varname>: Generar un flotante temporal de subtipo instante aleatorio

source: <varname>random_ttext_inst</varname>: Generate a random temporal text of instant subtype
es: <varname>random_ttext_inst</varname>: Generar un texto temporal de subtipo instante aleatorio

source: <varname>random_tgeompoint_inst</varname>: Generate a random temporal geometric 2D point of instant subtype
es: <varname>random_tgeompoint_inst</varname>: Generar un punto geométrico temporal 2D de subtipo instante aleatorio

source: <varname>random_tgeompoint3D_inst</varname>: Generate a random temporal geometric 3D point of instant subtype
es: <varname>random_tgeompoint3D_inst</varname>: Generar un punto geométrico temporal 3D de subtipo instante aleatorio

source: <varname>random_tgeogpoint_inst</varname>: Generate a random temporal geographic 2D point of instant subtype
es: <varname>random_tgeogpoint_inst</varname>: Generar un punto geográfico temporal 2D de subtipo instante aleatorio

source: <varname>random_tgeogpoint3D_inst</varname>: Generate a random temporal geographic 3D point of instant subtype
es: <varname>random_tgeogpoint3D_inst</varname>: Generar un punto geográfico temporal 3D de subtipo instante aleatorio

source: <varname>random_tbool_instset</varname>: Generate a random temporal Boolean of instant set subtype
es: <varname>random_tbool_instset</varname>: Generar un booleano temporal de subtipo conjunto de instantes aleatorio

source: <varname>random_tint_instset</varname>: Generate a random temporal integer of instant set subtype
es: <varname>random_tint_instset</varname>: Generar un entero temporal de subtipo conjunto de instantes aleatorio

source: <varname>random_tfloat_instset</varname>: Generate a random temporal float of instant set subtype
es: <varname>random_tfloat_instset</varname>: Generar un flotante temporal de subtipo conjunto de instantes aleatorio

source: <varname>random_ttext_instset</varname>: Generate a random temporal text of instant set subtype
es: <varname>random_ttext_instset</varname>: Generar un texto temporal de subtipo conjunto de instantes aleatorio

source: <varname>random_tgeompoint_instset</varname>: Generate a random temporal geometric 2D point of instant set subtype
es: <varname>random_tgeompoint_instset</varname>: Generar un punto temporal geométrico 2D de subtipo conjunto de instantes aleatorio

source: <varname>random_tgeompoint3D_instset</varname>: Generate a random temporal geometric 3D point of instant set subtype
es: <varname>random_tgeompoint3D_instset</varname>: Generar un punto geométrico temporal 3D de subtipo conjunto de instantes aleatorio

source: <varname>random_tgeogpoint_instset</varname>: Generate a random temporal geographic 2D point of instant set subtype
es: <varname>random_tgeogpoint_instset</varname>: Generar un punto geográfico temporal 2D de subtipo conjunto de instantes aleatorio

source: <varname>random_tgeogpoint3D_instset</varname>: Generate a random temporal geographic 3D point of instant set subtype
es: <varname>random_tgeogpoint3D_instset</varname>: Generar un punto geográfico temporal 3D de subtipo conjunto de instantes aleatorio

source: <varname>random_tbool_seq</varname>: Generate a random temporal Boolean of sequence subtype
es: <varname>random_tbool_seq</varname>: Generar un booleano temporal de subtipo secuencia aleatorio

source: <varname>random_tint_seq</varname>: Generate a random temporal integer of sequence subtype
es: <varname>random_tint_seq</varname>: Generar un entero temporal de subtipo secuencia aleatorio

source: <varname>random_tfloat_seq</varname>: Generate a random temporal float of sequence subtype
es: <varname>random_tfloat_seq</varname>: Generar un flotante temporal de subtipo secuencia aleatorio

source: <varname>random_ttext_seq</varname>: Generate a random temporal text of sequence subtype
es: <varname>random_ttext_seq</varname>: Generar un texto temporal de subtipo secuencia aleatorio

source: <varname>random_tgeompoint_seq</varname>: Generate a random temporal geometric 2D point of sequence subtype
es: <varname>random_tgeompoint_seq</varname>: Generar un punto geométrico temporal 2D de subtipo secuencia aleatorio

source: <varname>random_tgeompoint3D_seq</varname>: Generate a random temporal geometric 3D point of sequence subtype
es: <varname>random_tgeompoint3D_seq</varname>: Generar un punto geométrico temporal 3D de subtipo secuencia aleatorio

source: <varname>random_tgeogpoint_seq</varname>: Generate a random temporal geographic 2D point of sequence subtype
es: <varname>random_tgeogpoint_seq</varname>: Generar un punto geográfico temporal 2D de subtipo secuencia aleatorio

source: <varname>random_tgeogpoint3D_seq</varname>: Generate a random temporal geographic 3D point of sequence subtype
es: <varname>random_tgeogpoint3D_seq</varname>: Generar un punto geográfico temporal 3D de subtipo secuencia aleatorio

source: <varname>random_tbool_seqset</varname>: Generate a random temporal Boolean of sequence set subtype
es: <varname>random_tbool_seqset</varname>: Generar un booleano temporal de subtipo conjunto de secuencias aleatorio

source: <varname>random_tint_seqset</varname>: Generate a random temporal integer of sequence set subtype
es: <varname>random_tint_seqset</varname>: Generar un entero temporal de subtipo conjunto de secuencias aleatorio

source: <varname>random_tfloat_seqset</varname>: Generate a random temporal float of sequence set subtype
es: <varname>random_tfloat_seqset</varname>: Generar un flotante temporal de subtipo conjunto de secuencias aleatorio

source: <varname>random_ttext_seqset</varname>: Generate a random temporal text of sequence set subtype
es: <varname>random_ttext_seqset</varname>: Generar un texto temporal de subtipo conjunto de secuencias aleatorio

source: <varname>random_tgeompoint_seqset</varname>: Generate a random temporal geometric 2D point of sequence set subtype
es: <varname>random_tgeompoint_seqset</varname>: Generar un punto geométrico temporal 2D de subtipo conjunto de secuencias aleatorio

source: <varname>random_tgeompoint3D_seqset</varname>: Generate a random temporal geometric 3D point of sequence set subtype
es: <varname>random_tgeompoint3D_seqset</varname>: Generar un punto geométrico temporal 3D de subtipo conjunto de secuencias aleatorio

source: <varname>random_tgeogpoint_seqset</varname>: Generate a random temporal geographic 2D point of sequence set subtype
es: <varname>random_tgeogpoint_seqset</varname>: Generar un punto geográfico temporal 2D de subtipo conjunto de secuencias aleatorio

source: <varname>random_tgeogpoint3D_seqset</varname>: Generate a random temporal geographic 3D point of sequence set subtype
es: <varname>random_tgeogpoint3D_seqset</varname>: Generar un punto geográfico temporal 3D de subtipo conjunto de secuencias aleatorio

source: Generation of Tables with Random Values
es: Generación de tablas con valores aleatorios

source: The files <ulink url="https://github.com/MobilityDB/MobilityDB/datagen/general/create_test_tables_temporal.sql">create_test_tables_temporal.sql</ulink> and <ulink url="https://github.com/MobilityDB/MobilityDB/datagen/point/create_test_tables_tpoint.sql">create_test_tables_tpoint.sql</ulink> provide usage examples for the functions generating random values listed above. For example, the first file defines the following function.
es: Los archivos <ulink url="https://github.com/MobilityDB/MobilityDB/datagen/general/create_test_tables_temporal.sql">create_test_tables_temporal.sql</ulink> and <ulink url="https://github.com/MobilityDB/MobilityDB/datagen/point/create_test_tables_tpoint.sql">create_test_tables_tpoint.sql</ulink> dan ejemplos de utilización de las funciones que generan valores aleatorios listadas arriba. Por ejemplo, el primer archivo define la función siguiente.

source: The function has a <varname>size</varname> parameter that defines the number of rows in the tables. If not provided, it creates by default tables of 100 rows. The function defines a variable <varname>perc</varname> that computes the 1% of the size of the tables. This parameter is used, for example, for generating tables having 1% of null values. We illustrate next some of the commands generating tables.
es: La función tiene un parámetro <varname>size</varname> que define el número de filas en las tablas. Si no se proporciona, crea por defecto tablas de 100 filas. La función define una variable <varname>perc</varname> que calcula el 1% del tamaño de las tablas. Este parámetro se utiliza, por ejemplo, para generar tablas con un 1% de valores nulos. A continuación ilustramos algunos de los comandos que generan tablas.

source: The creation of a table <varname>tbl_float</varname> containing random <varname>float</varname> values in the range [0,100] with 1% of null values is given next.
es: La creación de una tabla <varname>tbl_float</varname> que contiene valores aleatorios <varname>float</varname> en el rango [0,100] con 1% de valores nulos se da a continuación.

source: CREATE TABLE tbl_float AS /* Add perc NULL values */ SELECT k, NULL AS f FROM generate_series(1, perc) AS k UNION SELECT k, random_float(0, 100) FROM generate_series(perc+1, size) AS k;
es: CREATE TABLE tbl_float AS /* Add perc NULL valores */ SELECT k, NULL AS f FROM generate_series(1, perc) AS k UNION SELECT k, random_float(0, 100) FROM generate_series(perc+1, size) AS k;

source: The creation of a table <varname>tbl_tbox</varname> containing random <varname>tbox</varname> values where the bounds for values are in the range [0,100] and the bounds for timestamps are in the range [2001-01-01, 2001-12-31] is given next.
es: La creación de una tabla <varname>tbl_tbox</varname> que contiene valores aleatorios <varname>tbox</varname> donde los límites de los valores están en el rango [0,100] y los límites de las marcas de tiempo están en el rango [2001-01-01, 2001-12-31] se da a continuación.
