Repository: MobilityDB/MobilityDB
Catalog: doc/*/introduction.po
Languages: es

source: Introduction
es: Introducción

source: MobilityDB is an extension of <ulink url="http://postgresql.org">PostgreSQL</ulink> and <ulink url="http://postgis.net">PostGIS</ulink> that provides <emphasis>temporal types</emphasis>. Such data types represent the evolution on time of values of some element type, called the <emphasis>base type</emphasis> of the temporal type. For instance, temporal integers may be used to represent the evolution on time of the number of employees of a department. In this case, the data type is <emphasis>temporal integer</emphasis> and the base type is <emphasis>integer</emphasis>. Similarly, a temporal float may be used to represent the evolution on time of the temperature of a room. As another example, a temporal point may be used to represent the evolution on time of the location of a car, as reported by GPS devices. Temporal types are useful because representing values that evolve in time is essential in many applications, for example in mobility applications. Furthermore, the operators on the base types (such as arithmetic operators and aggregation for integers and floats, spatial relationships and distance for geometries) can be intuitively generalized when the values evolve in time.
es: MobilityDB es una extensión de <ulink url="http://postgresql.org"> PostgreSQL</ulink> y <ulink url="http://postgis.net"> PostGIS</ulink> que proporciona <emphasis>tipos temporales</emphasis>. Dichos tipos de datos representan la evolución en el tiempo de los valores de algún tipo de elemento, llamado tipo base del tipo temporal. Por ejemplo, se pueden usar enteros temporales para representar la evolución en el tiempo del número de empleados de un departamento. En este caso, el tipo de datos es <emphasis>entero temporal</emphasis> y el tipo base es <emphasis>entero</emphasis>. Del mismo modo, se puede utilizar un número flotante temporal para representar la evolución en el tiempo de la temperatura de una habitación. Como otro ejemplo, se puede usar un punto temporal para representar la evolución en el tiempo de la ubicación de un automóvil, como lo reportan los dispositivos GPS. Los tipos temporales son útiles porque representar valores que evolucionan en el tiempo es esencial en muchas aplicaciones, por ejemplo, en aplicaciones de movilidad. Además, los operadores de los tipos base (como los operadores aritméticos y la agregación para números enteros y flotantes, las relaciones espaciales y la distancia para las geometrías) se pueden generalizar intuitivamente cuando los valores evolucionan en el tiempo.

source: MobilityDB provides the following temporal types: <varname>tbool</varname>, <varname>tint</varname>, <varname>tfloat</varname>, <varname>ttext</varname>, <varname>tgeompoint</varname>, and <varname>tgeogpoint</varname>. These temporal types are based, respectively, on the <varname>bool</varname>, <varname>int</varname>, <varname>float</varname>, and <varname>text</varname> base types provided by PostgreSQL, and on the <varname>geometry</varname> and <varname>geography</varname> base types provided by PostGIS (restricted to 2D or 3D points).<footnote><para>Although 4D temporal points can be represented, the M dimension is currently not taken into account.</para></footnote> Furthermore, MobilityDB uses four time types to represent extents of time: the <varname>timestamptz</varname> type provided by PostgreSQL and three new types which are <varname>period</varname>, <varname>timestampset</varname>, and <varname>periodset</varname>. In addition, two range types are defined in MobilityDB: <varname>intrange</varname> and <varname>floatrange</varname>.
es: MobilityDB proporciona los siguientes tipos temporales: <varname>tbool</varname>, <varname>tint</varname>, <varname>tfloat</varname>, <varname>ttext</varname>, <varname>tgeompoint</varname> y <varname>tgeogpoint</varname>. Estos tipos temporales se basan, respectivamente, en los tipos de base <varname>bool</varname>, <varname>int</varname>, <varname>float</varname> y <varname>text</varname> proporcionados por PostgreSQL, y en los tipos base de <varname>geometry</varname> y <varname>geography</varname> proporcionados por PostGIS (restringido a puntos 2D o 3D).<footnote><para>Aunque los puntos temporales 4D se pueden representar, la dimensión M actualmente no se tiene en cuenta.</para></footnote> Además, MobilityDB usa cuatro tipos de tiempo para representar lapsos de tiempo: el tipo <varname>timestamptz</varname> proporcionado por PostgreSQL y tres nuevos tipos que son <varname>period</varname>, <varname>timestampset</varname> y <varname>periodset</varname>. Además, se definen dos tipos de rango en MobilityDB: <varname>intrange</varname> y <varname>floatrange</varname>.

source: Project Steering Committee
es: Comité directivo del proyecto

source: The MobilityDB Project Steering Committee (PSC) coordinates the general direction, release cycles, documentation, and outreach efforts for the MobilityDB project. In addition, the PSC provides general user support, accepts and approves patches from the general MobilityDB community and votes on miscellaneous issues involving MobilityDB such as developer commit access, new PSC members or significant API changes.
es: El comité directivo del proyecto MobilityDB (Project Steering Committee o PSC) coordina la dirección general, los ciclos de publicación, la documentación y los esfuerzos de divulgación para el proyecto MobilityDB. Además, el PSC proporciona soporte general al usuario, acepta y aprueba parches de la comunidad general de MobilityDB y vota sobre diversos problemas relacionados con MobilityDB, como el acceso de commit de los desarrolladores, nuevos miembros del PSC o cambios significativos en la interfaz de programación de aplicaciones (Application Programming Interface o API).

source: The current members in alphabetical order and their main responsibilities are given next:
es: A continuación se detallan los miembros actuales en orden alfabético y sus principales responsabilidades:

source: Mohamed Bakli: <ulink url="https://github.com/MobilityDB/MobilityDB-docker">MobilityDB-docker</ulink>, cloud and distributed versions, integration with <ulink url="https://www.citusdata.com/">Citus</ulink>
es: Mohamed Bakli: <ulink url="https://github.com/MobilityDB/MobilityDB-docker">MobilityDB-docker</ulink>, versiones distribuidas y en la nube, integración con <ulink url="https://www.citusdata.com/">Citus</ulink>

source: Anita Graser: integration with <ulink url="https://github.com/anitagraser/movingpandas">Moving Pandas</ulink> and the Python ecosystem, integration with <ulink url="https://qgis.org/">QGIS</ulink>
es: Anita Graser: integración con <ulink url="https://github.com/anitagraser/movingpandas">Moving Pandas</ulink> y el ecosistema de Python, integración con <ulink url="https://qgis.org/">QGIS</ulink>

source: Darafei Praliaskouski: integration with <ulink url="https://postgis.net/">PostGIS</ulink>
es: Darafei Praliaskouski: integración con <ulink url="https://postgis.net/">PostGIS</ulink>

source: Mahmoud Sakr: co-founder of the MobilityDB project, <ulink url="https://github.com/MobilityDB/MobilityDB-workshop">MobilityDB workshop</ulink>, integration with <ulink url="https://pgrouting.org/">pgRouting</ulink>
es: Mahmoud Sakr: cofundador del proyecto MobilityDB, <ulink url="https://github.com/MobilityDB/MobilityDB-workshop">Taller de MobilityDB</ulink>, integración con <ulink url="https://pgrouting.org/">pgRouting</ulink>

source: Esteban Zimányi (chair): co-founder of the MobilityDB project, overall project coordination, main contributor of the backend code, <ulink url="https://github.com/MobilityDB/MobilityDB-BerlinMOD">BerlinMOD benchmark</ulink>, <ulink url="https://github.com/MobilityDB/MobilityDB-python">MobilityDB-python</ulink>
es: Esteban Zimányi (chair): cofoundador del proyecto MobilityDB, coordinación general del proyecto, principal contribuidor del código de backend, <ulink url="https://github.com/MobilityDB/MobilityDB-BerlinMOD">BerlinMOD benchmark</ulink>, <ulink url="https://github.com/MobilityDB/MobilityDB-python">MobilityDB-python</ulink>

source: Other Code Contributors
es: Otros colaboradores del código

source: Corporate Sponsors
es: Patrocinadores corporativos

source: These are corporate entities (in alphabetical order) that have contributed developer time or direct monetary funding to the MobilityDB project.
es: Estas son entidades corporativas (en orden alfabético) que han contribuido con tiempo de desarrollador o financiación monetaria directa al proyecto MobilityDB.

source: Université libre de Bruxelles, Belgium
es: Université libre de Bruxelles, Bélgica

source: Licenses
es: Licencias

source: The following licenses can be found in MobilityDB:
es: Las siguientes licencias se pueden encontrar en MobilityDB:

source: Resource
es: Recurso

source: Licence
es: Licencia

source: MobilityDB code
es: Código MobilityDB

source: PostgreSQL Licence
es: Licencia PostgreSQL

source: MobilityDB documentation
es: Documentación MobilityDB

source: Creative Commons Attribution-Share Alike 3.0 License
es: Licencia Creative Commons Attribution-Share Alike 3.0

source: Installation
es: Instalación

source: Short Version
es: Versión corta

source: Extracting the tar ball
es: Extraer el tar ball

source: To compile assuming you have all the dependencies in your search path
es: Para compilar asumiendo que tiene todas las dependencias en su ruta de búsqueda

source: Once MobilityDB is installed, it needs to be enabled in each individual database you want to use it in. In this example, PostGIS 2.5.5 is been used:
es: Una vez que MobilityDB está instalado, debe habilitarse en cada base de datos individual en la que desee usarlo. En éste ejemplo se usa la versión 2.5.5 de PostGIS.

source: Get the Sources
es: Obtener las fuentes

source: The MobilityDB latest release can be found in <ulink url="https://github.com/MobilityDB/MobilityDB/releases/latest"></ulink>
es: La última versión de MobilityDB se puede encontrar en <ulink url="https://github.com/MobilityDB/MobilityDB/releases/latest"></ulink>

source: To download this release:
es: Para descargar esta versión:

source: Go to <xref linkend="short_version"/> to the extract and compile instructions.
es: Ir a <xref linkend="short_version"/> a las instrucciones de extracción y compilación.

source: To download the repository
es: Para descargar el repositorio

source: Go to <xref linkend="short_version"/> to the compile instructions (there is no tar ball).
es: Ir a <xref linkend="short_version"/> a las instrucciones de compilación (no hay tar ball).

source: Enabling the Database
es: Habilitación de la base de datos

source: MobilityDB is an extension that depends on PostGIS. Enabling PostGIS before enabling MobilityDB in the database can be done as follows
es: MobilityDB es una extensión que depende de PostGIS. Habilitar PostGIS antes de habilitar MobilityDB en la base de datos se puede hacer de la siguiente manera

source: Alternatively, this can be done in a single command by using <varname>CASCADE</varname>, which installs the required PostGIS extension before installing the MobilityDB extension
es: Alternativamente, esto se puede hacer con un solo comando usando <varname>CASCADE</varname>, que instala la extensión PostGIS requerida antes de instalar la extensión MobilityDB

source: Dependencies
es: Dependencias

source: Compilation Dependencies
es: Dependencias de compilación

source: To be able to compile MobilityDB, make sure that the following dependencies are met:
es: Para poder compilar MobilityDB, asegúrese de que se cumplan las siguientes dependencias:

source: GNU C compiler (<filename>gcc</filename>). Some other ANSI C compilers can be used but may cause problems compiling some dependencies such as PostGIS.
es: Compilador GNU C (<filename>gcc</filename>). Se pueden usar algunos otros compiladores ANSI C, pero pueden causar problemas al compilar algunas dependencias como PostGIS.

source: GNU Make (<filename>gmake</filename> or <filename>make</filename>) version 3.1 or higher. For many systems, GNU make is the default version of make. Check the version by invoking <filename>make -v</filename>.
es: GNU Make (<filename>gmake</filename> o <filename>make</filename>) versión 3.1 o superior. Para muchos sistemas, GNU make es la versión predeterminada de make. Verifique la versión invocando <filename>make -v</filename>.

source: PostgreSQL version 10 or higher. PostgreSQL is available from <ulink url="http://www.postgresql.org">http://www.postgresql.org</ulink>. Notice that for using SP-GiST indexes for MobilityDB you need at least PostgreSQL version 11.
es: PostgreSQL versión 10 o superior. PostgreSQL está disponible en <ulink url="http://www.postgresql.org">http://www.postgresql.org</ulink>. Tenga en cuenta que para usar índices SP-GiST para MobilityDB, necesita al menos la versión 11 de PostgreSQL.

source: PostGIS version 2.5. PostGIS is available from <ulink url="https://postgis.net/">https://postgis.net/</ulink>. PostGIS version 3.0 or higher is currently <emphasis role="bold">not supported</emphasis>, this is planned for future releases of MobilityDB.
es: PostGIS versión 2.5. PostGIS está disponible en <ulink url="https://postgis.net/">https://postgis.net/</ulink>. Actualmente, la versión 3.0 o superior de PostGIS <emphasis role="bold">no es compatible</emphasis>, esto está previsto para futuras versiones de MobilityDB.

source: GNU Scientific Library (GSL). GSL is available from <ulink url="https://www.gnu.org/software/gsl/">https://www.gnu.org/software/gsl/</ulink>. GSL is used for the random number generators.
es: Biblioteca científica GNU (GSL). GSL está disponible en <ulink url="https://www.gnu.org/software/gsl/"> https://www.gnu.org/software/gsl/</ulink>. GSL se utiliza para los generadores de números aleatorios.

source: Please notice that PostGIS has its own dependencies such as Proj4, GEOS, LibXML2, or JSON-C, and these libraries are also used in MobilityDB. For a full PostgreSQL/PostGIS support matrix and PostGIS/GEOS support matrix refer to <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS">http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS</ulink>.
es: Tenga en cuenta que PostGIS tiene sus propias dependencias, como Proj4, GEOS, LibXML2 o JSON-C y estas bibliotecas también se utilizan en MobilityDB. Para obtener una matriz de compatibilidad completa de PostgreSQL/PostGIS y una matriz de compatibilidad de PostGIS/GEOS, consulte <ulink url="http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS">http://trac.osgeo.org/postgis/wiki/UsersWikiPostgreSQLPostGIS</ulink>.

source: Optional Dependencies
es: Dependencias opcionales

source: For user's documentation
es: Para la documentación del usuario

source: DocBook (<varname>xsltproc</varname>) is required for building the documentation. Docbook is available from <ulink url="http://www.docbook.org/">http://www.docbook.org/</ulink>
es: DocBook (<varname>xsltproc</varname>) es necesario para crear la documentación. Docbook está disponible en <ulink url="http://www.docbook.org/">http://www.docbook.org/</ulink>

source: DBLatex (<filename>dblatex</filename>) is required for building the documentation in PDF format. DBLatex is available from <ulink url="http://dblatex.sourceforge.net/">http://dblatex.sourceforge.net/</ulink>
es: DBLatex (<filename>dblatex</filename>) es necesario para crear la documentación en formato PDF. DBLatex está disponible en <ulink url="http://dblatex.sourceforge.net/">http://dblatex.sourceforge.net/</ulink>

source: Example: Installing dependencies on Linux
es: Ejemplo: instalar dependencias en Linux

source: Database dependencies
es: Dependencias de base de datos

source: Build dependencies
es: Dependencias de construcción

source: Configuring
es: Configuración

source: MobilityDB uses the <varname>cmake</varname> system to do the configuration. The build directory must be different from the source directory.
es: MobilityDB usa el sistema <varname>cmake</varname> para realizar la configuración. El directorio de compilación deber ser diferente del directorio de origen.

source: To create the build directory
es: Para crear el directorio de compilación

source: To see the variables that can be configured
es: Para ver las variables que se pueden configurar

source: Build and Install
es: Construir e instalar

source: Please notice that the current version of MobilityDB has only been tested on Linux systems. It may work on other UNIX-like systems, but remain untested. Support for Windows is planned. We are looking for volunteers to help us to test MobilityDB on multiple platforms.
es: Tenga en cuenta que la versión actual de MobilityDB solo se ha probado en sistemas Linux. Puede funcionar en otros sistemas similares a UNIX, pero no se ha probado. Está previsto el soporte para Windows. Buscamos voluntarios que nos ayuden a probar MobilityDB en múltiples plataformas.

source: The following instructions start from <varname>path/to/MobilityDB</varname> on a Linux system
es: Las siguientes instrucciones comienzan desde <varname>path/to/MobilityDB</varname> en un sistema Linux

source: When the configuration changes
es: Cuando cambia la configuración

source: and start the build process as mentioned above.
es: e inicie el proceso de construcción como se mencionó anteriormente.

source: Testing
es: Pruebas

source: MobilityDB uses <varname>ctest</varname>, the CMake test driver program, for testing. This program will run the tests and report results.
es: MobilityDB utiliza <varname>ctest</varname>, el programa controlador de pruebas de CMake, para realizar pruebas. Este programa ejecutará las pruebas e informará los resultados.

source: To run all the tests
es: Para ejecutar todas las pruebas

source: To run a given test file
es: Para ejecutar un archivo de prueba dado

source: To run a set of given test files you can use wildcards
es: Para ejecutar un conjunto de archivos de prueba determinados se pueden utilizar comodines

source: Support
es: Soporte

source: MobilityDB community support is available through the MobilityDB github page, documentation, tutorials, mailing lists and others.
es: El soporte de la comunidad de MobilityDB está disponible a través de la página github de MobilityDB, documentación, tutoriales, listas de correo y otros.

source: Reporting Problems
es: Reporte de problemas

source: Bugs are reported and managed in an <ulink url="https://github.com/MobilityDB/MobilityDB/issues">issue tracker</ulink>. Please follow these steps:
es: Los errores son registrados y manejados en un <ulink url="https://github.com/MobilityDB/MobilityDB/issues">issue tracker</ulink>. Por favor siga los siguientes pasos:

source: Search the tickets to see if your problem has already been reported. If so, add any extra context you might have found, or at least indicate that you too are having the problem. This will help us prioritize common issues.
es: Busque las entradas para ver si su problema ya ha sido informado. Si es así, agregue cualquier contexto adicional que haya encontrado, o al menos indique que usted también está teniendo el problema. Esto nos ayudará a priorizar los problemas comunes.

source: If your problem is unreported, create a <ulink url="https://github.com/MobilityDB/MobilityDB/issues/new">new issue</ulink> for it.
es: Si su problema no se ha informado, cree un <ulink url="https://github.com/MobilityDB/MobilityDB/issues/new">nuevo asunto</ulink> para ello.

source: In your report include explicit instructions to replicate your issue. The best tickets include the exact SQL necessary to replicate a problem. Please also, note the operating system and versions of MobilityDB, PostGIS, and PostgreSQL.
es: En su informe, incluya instrucciones explícitas para replicar su problema. Las mejores etradas incluyen consultas SQL exactas que se necesitan para reproducir un problema. Reporte también el sistema operativo y las versiones de MobilityDB, PostGIS y PostgreSQL.

source: It is recommended to use the following wrapper on the problem to pin point the step that is causing the problem.
es: Se recomienda utilizar el siguiente envoltorio en su problema para determinar el paso que está causando el problema.

source: Mailing Lists
es: Listas de correo

source: There are two mailing lists for MobilityDB hosted on OSGeo mailing list server:
es: Hay dos listas de correo para MobilityDB alojadas en el servidor de listas de correo OSGeo:

source: User mailing list: <ulink url="http://lists.osgeo.org/mailman/listinfo/mobilitydb-users">http://lists.osgeo.org/mailman/listinfo/mobilitydb-users</ulink>
es: Lista de correo de usuarios: <ulink url="http://lists.osgeo.org/mailman/listinfo/mobilitydb-users">http://lists.osgeo.org/mailman/listinfo/mobilitydb-users</ulink>

source: Developer mailing list: <ulink url="http://lists.osgeo.org/mailman/listinfo/mobilitydb-dev">http://lists.osgeo.org/mailman/listinfo/mobilitydb-dev</ulink>
es: Lista de distribución de desarrolladores: <ulink url="http://lists.osgeo.org/mailman/listinfo/mobilitydb-dev">http://lists.osgeo.org/mailman/listinfo/mobilitydb-dev</ulink>

source: For general questions and topics about how to use MobilityDB, please write to the user mailing list.
es: Para preguntas generales y temas sobre cómo usar MobilityDB, escriba a la lista de correo de usuarios.
