Repository: MobilityDB/MobilityDB
Catalog: doc/*/reference.xml.po
Languages: es

source: MobilityDB Reference
es: Referencia de MobilityDB

source: Functions and Operators for Time Types and Range Types
es: Funciones y operadores para tipos de tiempo y tipos de rango

source: Constructor Functions
es: Funciones de constructor

source: <link linkend="period"><varname>period</varname></link>: Constructor for <varname>period</varname>
es: <link linkend="period"><varname>period</varname></link>: Constructor para <varname>period</varname>

source: <link linkend="timestampset"><varname>timestampset</varname></link>: Constructor for <varname>timestampset</varname>
es: <link linkend="timestampset"><varname>timestampset</varname></link>: Constructor para <varname>timestampset</varname>

source: <link linkend="periodset"><varname>periodset</varname></link>: Constructor for <varname>periodset</varname>
es: <link linkend="periodset"><varname>periodset</varname></link>: Constructor para <varname>periodset</varname>

source: Casting
es: Conversión de tipos

source: <link linkend="timestamptz_cast"><varname>timestamptz::time</varname></link>: Cast a <varname>timestamptz</varname> to another time type
es: <link linkend="timestamptz_cast"><varname>timestamptz::time</varname></link>: Convertir un <varname>timestamptz</varname> a otro tipo de tiempo

source: <link linkend="timestampset_cast"><varname>timestampset::periodset</varname></link>: Cast a <varname>timestampset</varname> to a <varname>periodset</varname>
es: <link linkend="timestampset_cast"><varname>timestampset::periodset</varname></link>: Convertir un <varname>timestampset</varname> a un <varname>periodset</varname>

source: <link linkend="period_cast"><varname>period::type</varname></link>: Cast a <varname>period</varname> to another time type
es: <link linkend="period_cast"><varname>period::type</varname></link>: Convertir un <varname>period</varname> a otro tipo de tiempo

source: <link linkend="tstzrange_cast"><varname>tstzrange::period</varname></link>: Cast a <varname>tstzrange</varname> to a <varname>period</varname>
es: <link linkend="tstzrange_cast"><varname>tstzrange::period</varname></link>: Convertir un <varname>tstzrange</varname> a un <varname>period</varname>

source: Accessor Functions
es: Funciones de accesor

source: <link linkend="time_memSize"><varname>memSize</varname></link>: Get the memory size in bytes
es: <link linkend="time_memSize"><varname>memSize</varname></link>: Obtener el tamaño de la memoria en bytes

source: <link linkend="lower"><varname>lower</varname></link>: Get the lower bound
es: <link linkend="lower"><varname>lower</varname></link>: Obtener el límite inferior

source: <link linkend="upper"><varname>upper</varname></link>: Get the upper bound
es: <link linkend="upper"><varname>upper</varname></link>: Obtener el límite superior

source: <link linkend="lower_inc"><varname>lower_inc</varname></link>: Is the lower bound inclusive?
es: <link linkend="lower_inc"><varname>lower_inc</varname></link>: ¿Es el límite inferior inclusivo?

source: <link linkend="upper_inc"><varname>upper_inc</varname></link>: Is the upper bound inclusive?
es: <link linkend="upper_inc"><varname>upper_inc</varname></link>: ¿Es el límite superior inclusivo?

source: <link linkend="time_duration"><varname>duration</varname></link>: Get the duration
es: <link linkend="time_duration"><varname>duration</varname></link>: Obtener el intervalo de tiempo

source: <link linkend="time_timespan"><varname>timespan</varname></link>: Get the timespan ignoring the potential time gaps
es: <link linkend="time_timespan"><varname>timespan</varname></link>: Obtener el intervalo de tiempo ignorando las posibles brechas de tiempo

source: <link linkend="period"><varname>period</varname></link>: Get the period on which the timestamp set or period set is defined ignoring the potential time gaps
es: <link linkend="period"><varname>period</varname></link>: Obtener el período en el que se define el conjunto de marcas de tiempo o el conjunto de períodos ignorando las posibles brechas de tiempo

source: <link linkend="time_numTimestamps"><varname>numTimestamps</varname></link>: Get the number of different timestamps
es: <link linkend="time_numTimestamps"><varname>numTimestamps</varname></link>: Obtener el número de marcas de tiempo diferentes

source: <link linkend="time_startTimestamp"><varname>startTimestamp</varname></link>: Get the start timestamp
es: <link linkend="time_startTimestamp"><varname>startTimestamp</varname></link>: Obtener la marca de tiempo inicial

source: <link linkend="time_endTimestamp"><varname>endTimestamp</varname></link>: Get the end timestamp
es: <link linkend="time_endTimestamp"><varname>endTimestamp</varname></link>: Obtener la marca de tiempo final

source: <link linkend="time_timestampN"><varname>timestampN</varname></link>: Get the n-th different timestamp
es: <link linkend="time_timestampN"><varname>timestampN</varname></link>: Obtener la enésima marca de tiempo diferente

source: <link linkend="time_timestamps"><varname>timestamps</varname></link>: Get the different timestamps
es: <link linkend="time_timestamps"><varname>timestamps</varname></link>: Obtener las marcas de tiempo diferentes

source: <link linkend="numPeriods"><varname>numPeriods</varname></link>: Get the number of periods
es: <link linkend="numPeriods"><varname>numPeriods</varname></link>: Obtener el número de períodos

source: <link linkend="startPeriod"><varname>startPeriod</varname></link>: Get the start period
es: <link linkend="startPeriod"><varname>startPeriod</varname></link>: Obtener el período inicial

source: <link linkend="endPeriod"><varname>endPeriod</varname></link>: Get the end period
es: <link linkend="endPeriod"><varname>endPeriod</varname></link>: Obtener el período final

source: <link linkend="periodN"><varname>periodN</varname></link>: Get the n-th period
es: <link linkend="periodN"><varname>periodN</varname></link>: Obtener el enésimo período

source: <link linkend="periods"><varname>periods</varname></link>: Get the periods
es: <link linkend="periods"><varname>periods</varname></link>: Obtener los períodos

source: Modification Functions
es: Funciones de modificación

source: <link linkend="time_shift"><varname>shift</varname></link>: Shift the time value by an interval
es: <link linkend="time_shift"><varname>shift</varname></link>: Desplazar el valor de tiempo con un intervalo

source: <link linkend="floatrange_setPrecision"><varname>setPrecision</varname></link>: Round the bounds of a float range to a number of decimal places
es: <link linkend="floatrange_setPrecision"><varname>setPrecision</varname></link>: Redondear los límites de un rango flotante a un número de decimales

source: Comparison Operators
es: Operadores de comparación

source: <link linkend="time_eq"><varname>=</varname></link>: Are the time values equal?
es: <link linkend="time_eq"><varname>=</varname></link>: ¿Son iguales los valores de tiempo?

source: <link linkend="time_ne"><varname>&lt;&gt;</varname></link>: Are the time values different?
es: <link linkend="time_ne"><varname>&lt;&gt;</varname></link>: ¿Son diferentes los valores de tiempo?

source: <link linkend="time_lt"><varname>&lt;</varname></link>: Is the first time value less than the second one?
es: <link linkend="time_lt"><varname>&lt;</varname></link>: ¿Es el primer valor de tiempo menor que el segundo?

source: <link linkend="time_gt"><varname>&gt;</varname></link>: Is the first time value greater than the second one?
es: <link linkend="time_gt"><varname>&gt;</varname></link>: ¿Es el primer valor de tiempo mayor que el segundo?

source: <link linkend="time_le"><varname>&lt;=</varname></link>: Is the first time value less than or equal to the second one?
es: <link linkend="time_le"><varname>&lt;=</varname></link>: ¿Es el primer valor de tiempo menor o igual que el segundo?

source: <link linkend="time_ge"><varname>&gt;=</varname></link>: Is the first time value greater than or equal to the second one?
es: <link linkend="time_ge"><varname>&gt;=</varname></link>: ¿Es el primer valor de tiempo mayor o igual que el segundo?

source: Set Operators
es: Operadores de conjuntos

source: <link linkend="time_union"><varname>+</varname></link>: Union of the time values
es: <link linkend="time_union"><varname>+</varname></link>: Unión de valores de tiempo

source: <link linkend="time_intersection"><varname>*</varname></link>: Intersection of the time values
es: <link linkend="time_intersection"><varname>*</varname></link>: Intersección de valores de tiempo

source: <link linkend="time_difference"><varname>-</varname></link>: Difference of the time values
es: <link linkend="time_difference"><varname>-</varname></link>: Diferencia de valores de tiempo

source: Topological and Relative Position Operators
es: Operadores topológicos y de posición relativa

source: <link linkend="time_overlaps"><varname>&amp;&amp;</varname></link>: Do the time values overlap (have instants in common)?
es: <link linkend="time_overlaps"><varname>&amp;&amp;</varname></link>: ¿Se superponen los valores de tiempo (tienen instantes en común)?

source: <link linkend="time_contains"><varname>@&gt;</varname></link>: Does the first time value contain the second one?
es: <link linkend="time_contains"><varname>@&gt;</varname></link>: ¿Contiene el primer valor de tiempo el segundo?

source: <link linkend="time_containedby"><varname>&lt;@</varname></link>: Is the first time value contained by the second one?
es: <link linkend="time_containedby"><varname>&lt;@</varname></link>: ¿Está el primer valor de tiempo contenido en el segundo?

source: <link linkend="time_adjacent"><varname>-|-</varname></link>: Is the first time value adjacent to the second one?
es: <link linkend="time_adjacent"><varname>-|-</varname></link>: ¿Es el primer valor de tiempo adyacente al segundo?

source: <link linkend="range_left"><varname>&lt;&lt;</varname></link>: Is the first number or range value scritly left of the second one?
es: <link linkend="range_left"><varname>&lt;&lt;</varname></link>: ¿Está el primer número o valor de rango estrictamente a la izquierda del segundo?

source: <link linkend="range_right"><varname>&gt;&gt;</varname></link>: Is the first number or range value strictly right of the second one?
es: <link linkend="range_right"><varname>&gt;&gt;</varname></link>: ¿Está el primer número o valor de rango estrictamente a la izquierda del segundo?

source: <link linkend="range_overleft"><varname>&amp;&lt;</varname></link>: Is the first number or range value not to the right of the second one?
es: <link linkend="range_overleft"><varname>&amp;&lt;</varname></link>: ¿No está el primer número o valor de rango a la derecha del segundo?

source: <link linkend="range_overright"><varname>&amp;&gt;</varname></link>: Is the first number or range value not to the left of the second one?
es: <link linkend="range_overright"><varname>&amp;&gt;</varname></link>: ¿No está el primer número o valor de rango a la izquierda del segundo?

source: <link linkend="range_adjacent"><varname>-|-</varname></link>: Is the first number or range value adjacent to the second one?
es: <link linkend="range_adjacent"><varname>-|-</varname></link>: ¿Es el primer número o valor de rango adyacente al segundo?

source: <link linkend="time_before"><varname>&lt;&lt;#</varname></link>: Is the first time value scritly before the second one?
es: <link linkend="time_before"><varname>&lt;&lt;#</varname></link>: ¿Es el primer valor de tiempo estrictamente anterior al segundo?

source: <link linkend="time_after"><varname>#&gt;&gt;</varname></link>: Is the first time value strictly after the second one?
es: <link linkend="time_after"><varname>#&gt;&gt;</varname></link>: ¿Es el primer valor de tiempo estrictamente posterior al segundo?

source: <link linkend="time_overbefore"><varname>&amp;&lt;#</varname></link>: Is the first time value not after the second one?
es: <link linkend="time_overbefore"><varname>&amp;&lt;#</varname></link>: ¿No es el primer valor de tiempo posterior al segundo?

source: <link linkend="time_overafter"><varname>#&amp;&gt;</varname></link>: Is the first time value not before the second one?
es: <link linkend="time_overafter"><varname>#&amp;&gt;</varname></link>: ¿No es el primer valor de tiempo anterior al segundo?

source: Aggregate Functions
es: Funciones agregadas

source: <link linkend="time_tcount"><varname>tcount</varname></link>: Temporal count
es: <link linkend="time_tcount"><varname>tcount</varname></link>: Conteo temporal

source: <link linkend="time_extent"><varname>extent</varname></link>: Bounding period
es: <link linkend="time_extent"><varname>extent</varname></link>: Extensión del período delimitador

source: <link linkend="range_extent"><varname>extent</varname></link>: Bounding range
es: <link linkend="range_extent"><varname>extent</varname></link>: Extensión del rango delimitador

source: <link linkend="tunion"><varname>tunion</varname></link>: Temporal union
es: <link linkend="tunion"><varname>tunion</varname></link>: Unión temporal

source: Functions and Operators for Box Types
es: Funciones y operadores para tipos de cuadro delimitadores

source: <link linkend="tbox"><varname>tbox</varname></link>: Constructor for <varname>tbox</varname>
es: <link linkend="tbox"><varname>tbox</varname></link>: Constructor para <varname>tbox</varname>

source: <link linkend="stbox"><varname>stbox, stboxt</varname></link>: Constructor for <varname>stbox</varname>
es: <link linkend="stbox"><varname>stbox, stboxt</varname></link>: Constructor para <varname>stbox</varname>

source: <link linkend="tbox_cast_to"><varname>tbox::type</varname></link>: Cast a <varname>tbox</varname> to another type
es: <link linkend="tbox_cast_to"><varname>tbox::type</varname></link>: Convertir un <varname>tbox</varname> a otro tipo

source: <link linkend="tbox_cast_from"><varname>type::tbox</varname></link>: Cast another type to a <varname>tbox</varname>
es: <link linkend="tbox_cast_from"><varname>type::tbox</varname></link>: Convertir otro tipo a un <varname>tbox</varname>

source: <link linkend="stbox_cast_to"><varname>stbox::type</varname></link>: Cast an <varname>stbox</varname> to anoter type
es: <link linkend="stbox_cast_to"><varname>stbox::type</varname></link>: Convertir un <varname>stbox</varname> a otro tipo

source: <link linkend="stbox_cast_from"><varname>type::stbox</varname></link>: Cast another type to an <varname>stbox</varname>
es: <link linkend="stbox_cast_from"><varname>type::stbox</varname></link>: Convertir otro tipo a un <varname>stbox</varname>

source: <link linkend="hasX"><varname>hasX</varname></link>: Has X dimension?
es: <link linkend="hasX"><varname>hasX</varname></link>: ¿Tiene dimension X?

source: <link linkend="hasZ"><varname>hasZ</varname></link>: Has Z dimension?
es: <link linkend="hasZ"><varname>hasZ</varname></link>: ¿Tiene dimension Z?

source: <link linkend="hasT"><varname>hasT</varname></link>: Has T dimension?
es: <link linkend="hasT"><varname>hasT</varname></link>: ¿Tiene dimension T?

source: <link linkend="Xmin"><varname>Xmin</varname></link>: Get the minimum X value
es: <link linkend="Xmin"><varname>Xmin</varname></link>: Obtener el valor mínimo de X

source: <link linkend="Xmax"><varname>Xmax</varname></link>: Get the maximum X value
es: <link linkend="Xmax"><varname>Xmax</varname></link>: Obtener el valor máximo de X

source: <link linkend="Ymin"><varname>Ymin</varname></link>: Get the minimum Y value
es: <link linkend="Ymin"><varname>Ymin</varname></link>: Obtener el valor mínimo de Y

source: <link linkend="Ymax"><varname>Ymax</varname></link>: Get the maximum Y value
es: <link linkend="Ymax"><varname>Ymax</varname></link>: Obtener el valor máximo de Y

source: <link linkend="Zmin"><varname>Zmin</varname></link>: Get the minimum Z value
es: <link linkend="Zmin"><varname>Zmin</varname></link>: Obtener el valor mínimo de Z

source: <link linkend="Zmax"><varname>Zmax</varname></link>: Get the maximum Z value
es: <link linkend="Zmax"><varname>Zmax</varname></link>: Obtener el valor máximo de Z

source: <link linkend="Tmin"><varname>Tmin</varname></link>: Get the minimum T value
es: <link linkend="Tmin"><varname>Tmin</varname></link>: Obtener el valor mínimo de T

source: <link linkend="Tmax"><varname>Tmax</varname></link>: Get the maximum T value
es: <link linkend="Tmax"><varname>Tmax</varname></link>: Obtener el valor máximo de T

source: <link linkend="expandValue"><varname>expandValue</varname></link>: Expand the numeric value dimension of the bounding box by a float value
es: <link linkend="expandValue"><varname>expandValue</varname></link>: Extender la dimensión de valor numérico del cuadro delimitador con un valor flotante

source: <link linkend="expandSpatial"><varname>expandSpatial</varname></link>: Expand the spatial value dimension of the bounding box by a float value
es: <link linkend="expandSpatial"><varname>expandSpatial</varname></link>: Extender la dimensión de valor espacial del cuadro delimitador con un valor flotante

source: <link linkend="expandTemporal"><varname>expandTemporal</varname></link>: Expand the temporal dimension of the bounding box by a time interval
es: <link linkend="expandTemporal"><varname>expandTemporal</varname></link>: Extender la dimensión temporal del cuadro delimitador con un intervalo de tiempo

source: <link linkend="box_setPrecision"><varname>setPrecision</varname></link>: Round the value or the coordinates of the bounding box to a number of decimal places
es: <link linkend="box_setPrecision"><varname>setPrecision</varname></link>: Redondear el valor o las coordenadas del cuadro delimitador a un número de decimales

source: Spatial Reference System Functions
es: Funciones del sistema de referencia espacial

source: <link linkend="stbox_SRID"><varname>SRID</varname></link>: Get the spatial reference identifier
es: <link linkend="stbox_SRID"><varname>SRID</varname></link>: Obtener el identificador de referencia espacial

source: <link linkend="stbox_setSRID"><varname>setSRID</varname></link>: Set the spatial reference identifier
es: <link linkend="stbox_setSRID"><varname>setSRID</varname></link>: Especificar el identificador de referencia espacial

source: <link linkend="stbox_transform"><varname>transform</varname></link>: Transform to a different spatial reference
es: <link linkend="stbox_transform"><varname>transform</varname></link>: Transformar a una referencia espacial diferente

source: <link linkend="box_extent"><varname>extent</varname></link>: Bounding box extent
es: <link linkend="box_extent"><varname>extent</varname></link>: Extensión del cuadro delimitador

source: <link linkend="box_eq"><varname>=</varname></link>: Are the bounding boxes equal?
es: <link linkend="box_eq"><varname>=</varname></link>: ¿Son iguales los cuadros delimitadores?

source: <link linkend="box_ne"><varname>&lt;&gt;</varname></link>: Are the bounding boxes different?
es: <link linkend="box_ne"><varname>&lt;&gt;</varname></link>: ¿Son diferentes los cuadros delimitadores?

source: <link linkend="box_lt"><varname>&lt;</varname></link>: Is the first bouding box less than the second one?
es: <link linkend="box_lt"><varname>&lt;</varname></link>: ¿Es el primer cuadro delimitador menor que el segundo?

source: <link linkend="box_gt"><varname>&gt;</varname></link>: Is the first bouding box greater than the second one?
es: <link linkend="box_gt"><varname>&gt;</varname></link>: ¿Es el primer cuadro delimitador mayor que el segundo?

source: <link linkend="box_le"><varname>&lt;=</varname></link>: Is the first bouding box less than or equal to the second one?
es: <link linkend="box_le"><varname>&lt;=</varname></link>: ¿Es el primer cuadro delimitador menor o igual que el segundo?

source: <link linkend="box_ge"><varname>&gt;=</varname></link>: Is the first bouding box greater than or equal to the second one?
es: <link linkend="box_ge"><varname>&gt;=</varname></link>: ¿Es el primer cuadro delimitador menor que el segundo?

source: <link linkend="box_union"><varname>+</varname></link>: Union of the bounding boxes
es: <link linkend="box_union"><varname>+</varname></link>: Union de los cuadros delimitadores

source: <link linkend="box_intersection"><varname>*</varname></link>: Intersection of the bounding boxes
es: <link linkend="box_intersection"><varname>*</varname></link>: Intersección de los cuadros delimitadores

source: Topological Operators
es: Operadores topológicos

source: <link linkend="box_overlap"><varname>&amp;&amp;</varname></link>: Do the bounding boxes overlap?
es: <link linkend="box_overlap"><varname>&amp;&amp;</varname></link>: ¿Se superponen los cuadros delimitadores?

source: <link linkend="box_contains"><varname>@&gt;</varname></link>: Does the first bounding box contain the second one?
es: <link linkend="box_contains"><varname>@&gt;</varname></link>: ¿Contiene el primer cuadro delimitador el segundo?

source: <link linkend="box_containedby"><varname>&lt;@</varname></link>: Is the first bounding box contained in the second one?
es: <link linkend="box_containedby"><varname>&lt;@</varname></link>: ¿Está el primer cuadro delimitador contenido en el segundo?

source: <link linkend="box_same"><varname>~=</varname></link>: Are the bounding boxes equal in their common dimensions?
es: <link linkend="box_same"><varname>~=</varname></link>: ¿Son los cuadros delimitadores iguales en sus dimensiones comunes?

source: <link linkend="box_adjacent"><varname>-|-</varname></link>: Are the bounding boxes adjacent?
es: <link linkend="box_adjacent"><varname>-|-</varname></link>: ¿Son los cuadros delimitadores adyacentes?

source: Relative Position Operators
es: Operadores de posición relativa

source: <link linkend="tbox_left"><varname>&lt;&lt;</varname></link>: Are the X values of the first bounding box strictly less than those of the second one?
es: <link linkend="tbox_left"><varname>&lt;&lt;</varname></link>: ¿Son los valores X del primer cuadro delimitador estrictamente mayores que los del segundo?

source: <link linkend="tbox_right"><varname>&gt;&gt;</varname></link>: Are the X values of the first bounding box strictly greater than those of the second one?
es: <link linkend="tbox_right"><varname>&gt;&gt;</varname></link>: ¿Son los valores X del primer cuadro delimitador estrictamente mayores que los del segundo?

source: <link linkend="tbox_overleft"><varname>&amp;&lt;</varname></link>: Are the X values of the first bounding box not greater than those of the second one?
es: <link linkend="tbox_overleft"><varname>&amp;&lt;</varname></link>: ¿No son los valores X del primer cuadro delimitador mayores que los del segundo?

source: <link linkend="tbox_overright"><varname>&amp;&gt;</varname></link>: Are the X values of the first bounding box not less than those of the second one?
es: <link linkend="tbox_overright"><varname>&amp;&gt;</varname></link>: ¿No son los valores X del primer cuadro delimitador menores que los del segundo?

source: <link linkend="stbox_left"><varname>&lt;&lt;</varname></link>: Are the X values of the first bounding box strictly to the left of those of the second one?
es: <link linkend="stbox_left"><varname>&lt;&lt;</varname></link>: ¿Están los valores X del primer cuadro delimitador estrictamente a la izquierda de los del segundo?

source: <link linkend="stbox_right"><varname>&gt;&gt;</varname></link>: Are the X values of the first bounding box strictly to the right of those of the second one?
es: <link linkend="stbox_right"><varname>&gt;&gt;</varname></link>: ¿Están los valores X del primer cuadro delimitador estrictamente a la derecha de los del segundo?

source: <link linkend="stbox_overleft"><varname>&amp;&lt;</varname></link>: Are the X values of the first bounding box not to the right of those of the second one?
es: <link linkend="stbox_overleft"><varname>&amp;&lt;</varname></link>: ¿No están los valores X del primer cuadro delimitador a la derecha de los del segundo?
