Repository: MobilityDB/MobilityDB
Catalog: doc/*/reference.xml.po
Languages: es

source: <link linkend="tgeogpointFromHexEWKB"><varname>tgeogpointFromHexEWKB</varname></link>: Input a temporal geography point from an Hexadecimal Extended Well-Known Binary (EWKB) representation as text
es: <link linkend="tgeogpointFromHexEWKB"><varname>tgeogpointFromHexEWKB</varname></link>: Entrar un punto temporal geográfico en representación hexadecimal extendida binaria conocida (Hexadecimal Extended Well-Known Binary o EWKB) en formato texto

source: <link linkend="tpoint_SRID"><varname>SRID</varname></link>: Get the spatial reference identifier
es: <link linkend="tpoint_SRID"><varname>SRID</varname></link>: Obtener el identificador de referencia espacial

source: <link linkend="tpoint_setSRID"><varname>setSRID</varname></link>: Set the spatial reference identifier
es: <link linkend="tpoint_setSRID"><varname>setSRID</varname></link>: Establecer el identificador de referencia espacial

source: <link linkend="tpoint_transform"><varname>transform</varname></link>: Transform to a different spatial reference
es: <link linkend="tpoint_transform"><varname>transform</varname></link>: Transformar a una referencia espacial diferente

source: <link linkend="tpoint_setPrecision"><varname>setPrecision</varname></link>: Round the coordinate values to a number of decimal places
es: <link linkend="tpoint_setPrecision"><varname>setPrecision</varname></link>: Redondear los valores de las coordenadas a un número de decimales

source: <link linkend="getX"><varname>getX</varname></link>: Get the X coordinate values as a temporal float
es: <link linkend="getX"><varname>getX</varname></link>: Obtener los valores de las coordenadas X como un número flotante temporal

source: <link linkend="getY"><varname>getY</varname></link>: Get the Y coordinate values as a temporal float
es: <link linkend="getY"><varname>getY</varname></link>: Obtener los valores de las coordenadas Y como un número flotante temporal

source: <link linkend="getZ"><varname>getZ</varname></link>: Get the Z coordinate values as a temporal float
es: <link linkend="getZ"><varname>getZ</varname></link>: Obtener los valores de las coordenadas Z como un número flotante temporal

source: <link linkend="length"><varname>length</varname></link>: Get the length traversed by the temporal point
es: <link linkend="isSimple"><varname>isSimple</varname></link>: Devuelve verdadero si el punto temporal no se auto-intersecta espacialmente

source: <link linkend="isSimple"><varname>isSimple</varname></link>: Returns true if the temporal point does not spatially self-intersect
es: <link linkend="makeSimple"><varname>makeSimple</varname></link>: Devuelve una matriz de fragmentos del punto temporal que son simples

source: <link linkend="makeSimple"><varname>makeSimple</varname></link>: Returns an array of fragments of the temporal point which are simple
es: <link linkend="length"><varname>length</varname></link>: Obtener la longitud atravesada por el punto temporal

source: <link linkend="cumulativeLength"><varname>cumulativeLength</varname></link>: Get the cumulative length traversed by the temporal point
es: <link linkend="cumulativeLength"><varname>cumulativeLength</varname></link>: Obtener la longitud acumulada atravesada por el punto temporal

source: <link linkend="speed"><varname>speed</varname></link>: Get the speed of the temporal point in units per second
es: <link linkend="speed"><varname>speed</varname></link>: Obtener la velocidad del punto temporal en unidades por segundo

source: <link linkend="twCentroid"><varname>twCentroid</varname></link>: Get the time-weighted centroid
es: <link linkend="twCentroid"><varname>twCentroid</varname></link>: Obtener el centroide ponderado en el tiempo

source: <link linkend="azimuth"><varname>azimuth</varname></link>: Get the temporal azimuth
es: <link linkend="azimuth"><varname>azimuth</varname></link>: Obtener el acimut temporal

source: <link linkend="nearestApproachInstant"><varname>nearestApproachInstant</varname></link>: Get the instant of the first temporal point at which the two arguments are at the nearest distance
es: <link linkend="nearestApproachInstant"><varname>nearestApproachInstant</varname></link>: Obtener el instante del primer punto temporal en el que los dos argumentos están a la distancia más cercana

source: <link linkend="nearestApproachDistance"><varname>nearestApproachDistance</varname></link>: Get the smallest distance ever
es: <link linkend="nearestApproachDistance"><varname>nearestApproachDistance</varname></link>: Obtener la distancia más pequeña que haya existido

source: <link linkend="shortestLine"><varname>shortestLine</varname></link>: Get the line connecting the nearest approach point
es: <link linkend="shortestLine"><varname>shortestLine</varname></link>: Obtener la línea que conecta el punto de aproximación más cercano

source: <link linkend="simplify"><varname>simplify</varname></link>: Simplify a temporal point using a generalization of the Douglas-Peucker algorithm
es: <link linkend="simplify"><varname>simplify</varname></link>: Simplificar un punto temporal usando una generalización del algoritmo de Douglas-Peucker

source: <link linkend="geoMeasure"><varname>geoMeasure</varname></link>: Construct a geometry/geography with M measure from a temporal point and a temporal float
es: <link linkend="geoMeasure"><varname>geoMeasure</varname></link>: Construir una geometría/geografía con medida M a partir de un punto temporal y un número flotante temporal

source: <link linkend="asMVTGeom"><varname>asMVTGeom</varname></link>: Transform a temporal geometric point into the coordinate space of a Mapbox Vector Tile
es: <link linkend="asMVTGeom"><varname>asMVTGeom</varname></link>: Transformar un punto geométrico temporal en el espacio de coordenadas de un Mapbox Vector Tile

source: Restriction Functions
es: Funciones de restricción

source: <link linkend="atValue"><varname>atValue</varname></link>: Restrict to a value
es: <link linkend="atValue"><varname>atValue</varname></link>: Restringir a un valor

source: <link linkend="atValues"><varname>atValues</varname></link>: Restrict to an array of values
es: <link linkend="atValues"><varname>atValues</varname></link>: Restringir a una matriz de valores

source: <link linkend="atRange"><varname>atRange</varname></link>: Restrict to a range
es: <link linkend="atRange"><varname>atRange</varname></link>: Restringir a un rango de valores

source: <link linkend="atRanges"><varname>atRanges</varname></link>: Restrict to an array of ranges
es: <link linkend="atRanges"><varname>atRanges</varname></link>: Restringir a una matriz de rangos de valores

source: <link linkend="atMin"><varname>atMin</varname></link>: Restrict to the minimum value
es: <link linkend="atMin"><varname>atMin</varname></link>: Restringir al valor mínimo

source: <link linkend="atMax"><varname>atMax</varname></link>: Restrict to the maximum value
es: <link linkend="atMax"><varname>atMax</varname></link>: Restringir al valor máximo

source: <link linkend="atGeometry"><varname>atGeometry</varname></link>: Restrict to a geometry
es: <link linkend="atGeometry"><varname>atGeometry</varname></link>: Restringir a una geometría

source: <link linkend="atTimestamp"><varname>atTimestamp</varname></link>: Restrict to a timestamp
es: <link linkend="atTimestamp"><varname>atTimestamp</varname></link>: Restringir a una marca de tiempo

source: <link linkend="atTimestampSet"><varname>atTimestampSet</varname></link>: Restrict to a timestamp set
es: <link linkend="atTimestampSet"><varname>atTimestampSet</varname></link>: Restringir a un conjunto de marcas de tiempo

source: <link linkend="atPeriod"><varname>atPeriod</varname></link>: Restrict to a period
es: <link linkend="atPeriod"><varname>atPeriod</varname></link>: Restringir a un período

source: <link linkend="atPeriodSet"><varname>atPeriodSet</varname></link>: Restrict to a period set
es: <link linkend="atPeriodSet"><varname>atPeriodSet</varname></link>: Restringir a un conjunto de períodos

source: <link linkend="atTbox"><varname>atTbox</varname></link>: Restrict to a <varname>tbox</varname>
es: <link linkend="atTbox"><varname>atTbox</varname></link>: Restringir a un <varname>tbox</varname>

source: <link linkend="atStbox"><varname>atStbox</varname></link>: Restrict to an <varname>stbox</varname>
es: <link linkend="atStbox"><varname>atStbox</varname></link>: Restringir a un <varname>stbox</varname>

source: Difference Functions
es: Funciones de diferencia

source: <link linkend="minusValue"><varname>minusValue</varname></link>: Difference with a value
es: <link linkend="minusValue"><varname>minusValue</varname></link>: Diferencia con un valor

source: <link linkend="minusValues"><varname>minusValues</varname></link>: Difference with an array of values
es: <link linkend="minusValues"><varname>minusValues</varname></link>: Diferencia con una matriz de valores

source: <link linkend="minusRange"><varname>minusRange</varname></link>: Difference with a range
es: <link linkend="minusRange"><varname>minusRange</varname></link>: Diferencia con un rango de valores

source: <link linkend="minusRanges"><varname>minusRanges</varname></link>: Difference with an array of ranges
es: <link linkend="minusRanges"><varname>minusRanges</varname></link>: Diferencia con una matriz de rangos de valores

source: <link linkend="minusMin"><varname>minusMin</varname></link>: Difference with the minimum value
es: <link linkend="minusMin"><varname>minusMin</varname></link>: Diferencia con el valor mínimo

source: <link linkend="minusMax"><varname>minusMax</varname></link>: Difference with the maximum value
es: <link linkend="minusMax"><varname>minusMax</varname></link>: Diferencia con el valor máximo

source: <link linkend="minusGeometry"><varname>minusGeometry</varname></link>: Difference with a geometry
es: <link linkend="minusGeometry"><varname>minusGeometry</varname></link>: Diferencia con una geometría

source: <link linkend="minusTimestamp"><varname>minusTimestamp</varname></link>: Difference with a timestamp
es: <link linkend="minusTimestamp"><varname>minusTimestamp</varname></link>: Diferencia con una marca de tiempo

source: <link linkend="minusTimestampSet"><varname>minusTimestampSet</varname></link>: Difference with a timestamp set
es: <link linkend="minusTimestampSet"><varname>minusTimestampSet</varname></link>: Diferencia con un conjunto de marcas de tiempo

source: <link linkend="minusPeriod"><varname>minusPeriod</varname></link>: Difference with period
es: <link linkend="minusPeriod"><varname>minusPeriod</varname></link>: Diferencia con un período

source: <link linkend="minusPeriodSet"><varname>minusPeriodSet</varname></link>: Difference with a period set
es: <link linkend="minusPeriodSet"><varname>minusPeriodSet</varname></link>: Diferencia con un conjunto de períodos

source: <link linkend="minusTbox"><varname>minusTbox</varname></link>: Difference with a <varname>tbox</varname>
es: <link linkend="minusTbox"><varname>minusTbox</varname></link>: Diferencia con un <varname>tbox</varname>

source: <link linkend="minusStbox"><varname>minusStbox</varname></link>: Difference with an <varname>stbox</varname>
es: <link linkend="minusStbox"><varname>minusStbox</varname></link>: Diferencia con un <varname>stbox</varname>

source: <link linkend="ttype_eq"><varname>=</varname></link>: Are the temporal values equal?
es: <link linkend="ttype_eq"><varname>=</varname></link>: ¿Son iguales los valores temporales?

source: <link linkend="ttype_ne"><varname>&lt;&gt;</varname></link>: Are the temporal values different?
es: <link linkend="ttype_ne"><varname>&lt;&gt;</varname></link>: ¿Son diferentes los valores temporales?

source: <link linkend="ttype_lt"><varname>&lt;</varname></link>: Is the first temporal value less than the second one?
es: <link linkend="ttype_lt"><varname>&lt;</varname></link>: ¿Es el primer valor temporal menor que el segundo?

source: <link linkend="ttype_gt"><varname>&gt;</varname></link>: Is the first temporal value greater than the second one?
es: <link linkend="ttype_gt"><varname>&gt;</varname></link>: ¿Es el primer valor temporal mayor que el segundo?

source: <link linkend="ttype_le"><varname>&lt;=</varname></link>: Is the first temporal value less than or equal to the second one?
es: <link linkend="ttype_le"><varname>&lt;=</varname></link>: ¿Es el primer valor temporal menor o igual que el segundo?

source: <link linkend="ttype_ge"><varname>&gt;=</varname></link>: Is the first temporal value greater than or equal to the second one?
es: <link linkend="ttype_ge"><varname>&gt;=</varname></link>: ¿Es el primer valor temporal mayor o igual que el segundo?

source: Ever and Always Comparison Operators
es: Operadores de comparación siempre y alguna vez

source: <link linkend="ttype_eveq"><varname>?=</varname></link>: Is the temporal value ever equal to the value?
es: <link linkend="ttype_eveq"><varname>?=</varname></link>: ¿Es el valor temporal alguna vez igual al valor?

source: <link linkend="ttype_evne"><varname>?&lt;&gt;</varname></link>: Is the temporal value ever different from the value?
es: <link linkend="ttype_evne"><varname>?&lt;&gt;</varname></link>: ¿Es el valor temporal alguna vez diferente del valor?

source: <link linkend="ttype_evlt"><varname>?&lt;</varname></link>: Is the temporal value ever less than the value?
es: <link linkend="ttype_evlt"><varname>?&lt;</varname></link>: ¿Es el valor temporal alguna vez menor que el valor?

source: <link linkend="ttype_evgt"><varname>?&gt;</varname></link>: Is the temporal value ever greater than the value?
es: <link linkend="ttype_evgt"><varname>?&gt;</varname></link>: ¿Es el valor temporal alguna vez mayor que el valor?

source: <link linkend="ttype_evle"><varname>?&lt;=</varname></link>: Is the temporal value ever less than or equal to the value?
es: <link linkend="ttype_evle"><varname>?&lt;=</varname></link>: ¿Es el valor temporal alguna vez menor o igual que el valor?

source: <link linkend="ttype_evge"><varname>?&gt;=</varname></link>: Is the temporal value ever greater than or equal to the value?
es: <link linkend="ttype_evge"><varname>?&gt;=</varname></link>: ¿Es el valor temporal alguna vez mayor o igual que el valor?

source: <link linkend="ttype_aleq"><varname>%=</varname></link>: Is the temporal value always equal to the value?
es: <link linkend="ttype_aleq"><varname>%=</varname></link>: ¿Es el valor temporal siempre igual que el valor?

source: <link linkend="ttype_alne"><varname>%&lt;&gt;</varname></link>: Is the temporal value always different to the value?
es: <link linkend="ttype_alne"><varname>%&lt;&gt;</varname></link>: ¿Es el valor temporal siempre diferente que el valor?

source: <link linkend="ttype_allt"><varname>%&lt;</varname></link>: Is the temporal value always less than the value?
es: <link linkend="ttype_allt"><varname>%&lt;</varname></link>: ¿Es el valor temporal siempre menor que el valor?

source: <link linkend="ttype_algt"><varname>%&gt;</varname></link>: Is the temporal value always greater than the value?
es: <link linkend="ttype_algt"><varname>%&gt;</varname></link>: ¿Es el valor temporal siempre mayor que el valor?

source: <link linkend="ttype_alle"><varname>%&lt;=</varname></link>: Is the temporal value always less than or equal to the value?
es: <link linkend="ttype_alle"><varname>%&lt;=</varname></link>: ¿Es el valor temporal siempre menor o igual que el valor?

source: <link linkend="ttype_alge"><varname>%&gt;=</varname></link>: Is the temporal value always greater than or equal to the value?
es: <link linkend="ttype_alge"><varname>%&gt;=</varname></link>: ¿Es el valor temporal siempre mayor o igual que el valor?

source: Temporal Comparison Operators
es: Operadores de comparación temporal

source: <link linkend="ttype_teq"><varname>#=</varname></link>: Temporal equal
es: <link linkend="ttype_teq"><varname>#=</varname></link>: Igual temporal

source: <link linkend="ttype_tne"><varname>#&lt;&gt;</varname></link>: Temporal different
es: <link linkend="ttype_tne"><varname>#&lt;&gt;</varname></link>: Diferente temporal

source: <link linkend="ttype_tlt"><varname>#&lt;</varname></link>: Temporal less than
es: <link linkend="ttype_tlt"><varname>#&lt;</varname></link>: Menor que temporal

source: <link linkend="ttype_tgt"><varname>#&gt;</varname></link>: Temporal greater than
es: <link linkend="ttype_tgt"><varname>#&gt;</varname></link>: Mayor que temporal

source: <link linkend="ttype_tle"><varname>#&lt;=</varname></link>: Temporal less than or equal to
es: <link linkend="ttype_tle"><varname>#&lt;=</varname></link>: Menor o igual que temporal

source: <link linkend="ttype_tge"><varname>#&gt;=</varname></link>: Temporal greater than or equal to
es: <link linkend="ttype_tge"><varname>#&gt;=</varname></link>: Mayor o igual que temporal

source: Mathematical Functions and Operators
es: Funciones y operadores matemáticos

source: <link linkend="tnumber_add"><varname>+</varname></link>: Temporal addition
es: <link linkend="tnumber_add"><varname>+</varname></link>: Adición temporal

source: <link linkend="tnumber_sub"><varname>-</varname></link>: Temporal subtraction
es: <link linkend="tnumber_sub"><varname>-</varname></link>: Resta temporal

source: <link linkend="tnumber_mult"><varname>*</varname></link>: Temporal multiplication
es: <link linkend="tnumber_mult"><varname>*</varname></link>: Multiplicación temporal

source: <link linkend="tnumber_div"><varname>/</varname></link>: Temporal division
es: <link linkend="tnumber_div"><varname>/</varname></link>: División temporal

source: <link linkend="round"><varname>round</varname></link>: Round the values to a number of decimal places
es: <link linkend="round"><varname>round</varname></link>: Redondear los valores a un número de posiciones decimales

source: <link linkend="degrees"><varname>degrees</varname></link>: Convert from radians to degrees
es: <link linkend="degrees"><varname>degrees</varname></link>: Convertir de radianes a grados

source: <link linkend="derivative"><varname>derivative</varname></link>: Get the derivative over time of the temporal float in units per second
es: <link linkend="derivative"><varname>derivative</varname></link>: Obtener la derivada sobre el tiempo del número temporal en unidades por segundo

source: Boolean Operators
es: Operadores booleanos

source: <link linkend="tbool_and"><varname>&amp;</varname></link>: Temporal and
es: <link linkend="tbool_and"><varname>&amp;</varname></link>: Y temporal

source: <link linkend="tbool_or"><varname>|</varname></link>: Temporal or
es: <link linkend="tbool_or"><varname>|</varname></link>: O temporal

source: <link linkend="tbool_not"><varname>~</varname></link>: Temporal not
es: <link linkend="tbool_not"><varname>~</varname></link>: No temporal

source: Text Functions and Operators
es: Funciones y operadores de texto

source: <link linkend="ttext_concat"><varname>||</varname></link>: Temporal text concatenation
es: <link linkend="ttext_concat"><varname>||</varname></link>: Concatenación de texto temporal

source: <link linkend="ttext_upper"><varname>upper</varname></link>: Transform to uppercase
es: <link linkend="ttext_upper"><varname>upper</varname></link>: Transformar a mayúsculas

source: <link linkend="ttext_lower"><varname>lower</varname></link>: Transform to lowercase
es: <link linkend="ttext_lower"><varname>lower</varname></link>: Transformar a minúsculas

source: Multidimensional Tiling
es: Mosaicos multidimensionales

source: Bucket Functions
es: Operaciones de intervalos

source: <link linkend="bucketList"><varname>bucketList</varname></link>: Returns a set of couples (index, bucket) that cover the range or period with buckets of the same width or duration aligned with the origin
es: <link linkend="bucketList"><varname>bucketList</varname></link>: Obtener un conjunto de parejas (índice, intervalo) que cubre el rango o el período con intervalos de la misma amplitud alineados con el origen

source: <link linkend="valueBucket"><varname>valueBucket</varname></link>: Returns the start value of the bucket that contains the input number.
es: <link linkend="valueBucket"><varname>valueBucket</varname></link>: Obtener el valor inicial del intervalo que contiene el número de entrada.

source: <link linkend="rangeBucket"><varname>rangeBucket</varname></link>: Returns the range in the bucket space that contains the input number
es: <link linkend="rangeBucket"><varname>rangeBucket</varname></link>: Obtener el rango en el espacio de intervalos contiene el número de entrada.

source: <link linkend="timeBucket"><varname>timeBucket</varname></link>: Returns the start timestamp of the bucket that contains the input timestamp.
es: <link linkend="timeBucket"><varname>timeBucket</varname></link>: Obtener el valor inicial del intervalo que contiene la marca de tiempo de entrada.

source: <link linkend="periodBucket"><varname>periodBucket</varname></link>: Returns a period in the bucket space that contains the input timestamp
es: <link linkend="periodBucket"><varname>periodBucket</varname></link>: Obtener el período en el espacio de intervalos que contiene la marca de tiempo de entrada.

source: Grid Functions
es: Operaciones de malla

source: <link linkend="multidimGrid"><varname>multidimGrid</varname></link>: Returns a set of couples (index, tile) that covers the box with multidimensional tiles of the same size and duration.
es: <link linkend="multidimGrid"><varname>multidimGrid</varname></link>: Obtener un conjunto de parejas (índices, mosaico) que cubre el cuadro delimitador con mosaicos multidimensionales del mismo tamaño y duración

source: <link linkend="multidimTile"><varname>multidimTile</varname></link>: Returns the tile of the multidimensional grid that contains the value and the timestamp
es: <link linkend="multidimTile"><varname>multidimTile</varname></link>: Obtener el mosaico de la malla multidimensional que contiene el valor y la marca de tiempo

source: Split Functions
es: Operaciones de fragmentación

source: <link linkend="valueSplit"><varname>valueSplit</varname></link>: Fragment the temporal number with respect to value buckets
es: <link linkend="valueSplit"><varname>valueSplit</varname></link>: Fragmentar el número temporal con respecto a intervalos de valores

source: <link linkend="timeSplit"><varname>timeSplit</varname></link>: Fragment the temporal value with respect to time buckets
es: <link linkend="timeSplit"><varname>timeSplit</varname></link>: Fragmentar el valor temporal con respecto a intervalos de tiempo

source: <link linkend="valueTimeSplit"><varname>valueTimeSplit</varname></link>: Fragment the temporal number with respect to the tiles in a value-time grid
es: <link linkend="valueTimeSplit"><varname>valueTimeSplit</varname></link>: Fragmentar el número temporal con respecto a los mosaicos de una malla de valores y de tiempo

source: <link linkend="spaceSlice"><varname>spaceSplit</varname></link>: Fragment the temporal point with respect to tiles in a spatial grid
es: <link linkend="spaceSplit"><varname>spaceSplit</varname></link>: Fragmentar el punto temporal con respecto a los mosaicos de una malla espacial

source: <link linkend="spaceTimeSlice"><varname>spaceTimeSplit</varname></link>: Fragment the temporal point with respect to tiles in a spatiotemporal grid
es: <link linkend="spaceTimeSplit"><varname>spaceTimeSplit</varname></link>: Fragmentar el punto temporal con respecto a los mosaicos de una malla espacio-temporal

source: Distance Operators
es: Operadores de distancia

source: <link linkend="smallest_distance"><varname>|=|</varname></link>: Get the smallest distance ever
es: <link linkend="smallest_distance"><varname>|=|</varname></link>: Obtener la distancia mínima que haya existido
