Repository: MobilityDB/MobilityDB
Catalog: doc/*/reference.xml.po
Languages: es

source: <link linkend="distance"><varname>&lt;-&gt;</varname></link>: Get the temporal distance
es: <link linkend="distance"><varname>&lt;-&gt;</varname></link>: Obtener la distancia temporal

source: Spatial Relationships
es: Relaciones espaciales

source: Possible Relationships
es: Relaciones posibles

source: <link linkend="contains"><varname>contains</varname></link>: May contain
es: <link linkend="contains"><varname>contains</varname></link>: Puede contener

source: <link linkend="disjoint"><varname>disjoint</varname></link>: May be disjoint
es: <link linkend="disjoint"><varname>disjoint</varname></link>: Puede ser disjunto

source: <link linkend="dwithin"><varname>dwithin</varname></link>: May be at distance within
es: <link linkend="dwithin"><varname>dwithin</varname></link>: Puede estar a distancia de

source: <link linkend="intersects"><varname>intersects</varname></link>: May intersect
es: <link linkend="intersects"><varname>intersects</varname></link>: Puede cruzarse

source: <link linkend="touches"><varname>touches</varname></link>: May touch
es: <link linkend="touches"><varname>touches</varname></link>: Puede tocar

source: Temporal Relationships
es: Relaciones temporales

source: <link linkend="tcontains"><varname>tcontains</varname></link>: Temporal contains
es: <link linkend="tcontains"><varname>tcontains</varname></link>: Contiene temporal

source: <link linkend="tdisjoint"><varname>tdisjoint</varname></link>: Temporal disjoint
es: <link linkend="tdisjoint"><varname>tdisjoint</varname></link>: Disjunto temporal

source: <link linkend="tdwithin"><varname>tdwithin</varname></link>: Temporal distance within
es: <link linkend="tdwithin"><varname>tdwithin</varname></link>: Estar a distancia de temporal

source: <link linkend="tintersects"><varname>tintersects</varname></link>: Temporal intersects
es: <link linkend="tintersects"><varname>tintersects</varname></link>: Intersección temporal

source: <link linkend="ttouches"><varname>ttouches</varname></link>: Temporal touches
es: <link linkend="ttouches"><varname>ttouches</varname></link>: Toca temporal

source: <link linkend="tcount"><varname>tcount</varname></link>: Temporal count
es: <link linkend="tcount"><varname>tcount</varname></link>: Conteo temporal

source: <link linkend="extent"><varname>extent</varname></link>: Bounding box extent
es: <link linkend="extent"><varname>extent</varname></link>: Extensión del cuadro delimitador

source: <link linkend="tand"><varname>tand</varname></link>: Temporal and
es: <link linkend="tand"><varname>tand</varname></link>: Y temporal

source: <link linkend="tor"><varname>tor</varname></link>: Temporal or
es: <link linkend="tor"><varname>tor</varname></link>: O temporal

source: <link linkend="tmin"><varname>tmin</varname></link>: Temporal minimum
es: <link linkend="tmin"><varname>tmin</varname></link>: Mínimo temporal

source: <link linkend="tmax"><varname>tmax</varname></link>: Temporal maximum
es: <link linkend="tmax"><varname>tmax</varname></link>: Máximo temporal

source: <link linkend="tsum"><varname>tsum</varname></link>: Temporal sum
es: <link linkend="tsum"><varname>tsum</varname></link>: Suma temporal

source: <link linkend="tavg"><varname>tavg</varname></link>: Temporal average
es: <link linkend="tavg"><varname>tavg</varname></link>: Promedio temporal

source: <link linkend="wmin"><varname>wmin</varname></link>: Window minimum
es: <link linkend="wmin"><varname>wmin</varname></link>: Mínimo de ventana

source: <link linkend="wmax"><varname>wmax</varname></link>: Window maximum
es: <link linkend="wmax"><varname>wmax</varname></link>: Máximo de ventana

source: <link linkend="wcount"><varname>wcount</varname></link>: Window count
es: <link linkend="wcount"><varname>wcount</varname></link>: Conteo de ventana

source: <link linkend="wsum"><varname>wsum</varname></link>: Window sum
es: <link linkend="wsum"><varname>wsum</varname></link>: Suma de ventana

source: <link linkend="wavg"><varname>wavg</varname></link>: Window average
es: <link linkend="wavg"><varname>wavg</varname></link>: Promedio de ventana

source: <link linkend="tcentroid"><varname>tcentroid</varname></link>: Temporal centroid
es: <link linkend="tcentroid"><varname>tcentroid</varname></link>: Centroide temporal

source: Utility Functions
es: Funciones de utilidad

source: <link linkend="mobilitydb_version"><varname>mobilitydb_version</varname></link>: Get the version of the MobilityDB extension
es: <link linkend="mobilitydb_version"><varname>mobilitydb_version</varname></link>: Versión de la extensión MobilityDB

source: <link linkend="mobilitydb_full_version"><varname>mobilitydb_full_version</varname></link>: Get the versions of the MobilityDB extension and its dependencies
es: <link linkend="mobilitydb_full_version"><varname>mobilitydb_full_version</varname></link>: Versión de la extensión MobilityDB y de sus dependencias

source: Functions and Operators for Temporal Network Points
es: Funciones y operadores para puntos de red temporales

source: Static Network Types
es: Tipos de red estáticos

source: <link linkend="npoint"><varname>npoint</varname></link>: Constructor for network points
es: <link linkend="npoint"><varname>npoint</varname></link>: Constructor para puntos de red

source: <link linkend="nsegment"><varname>nsegment</varname></link>: Constructor for network segments
es: <link linkend="nsegment"><varname>nsegment</varname></link>: Constructor para segmentos de red

source: <link linkend="nsegment_setPrecision"><varname>setPrecision</varname></link>: Set the precision of the position(s) of the network point or the network segment to the number of decimal places
es: <link linkend="nsegment_setPrecision"><varname>setPrecision</varname></link>: Establecer la precisión de la(s) posición(es) del punto de red or el segmento de red en el número de posiciones decimales

source: <link linkend="route"><varname>route</varname></link>: Get the route identifier
es: <link linkend="route"><varname>route</varname></link>: Obtener el identificador de ruta

source: <link linkend="getPosition"><varname>getPosition</varname></link>: Get the position fraction
es: <link linkend="getPosition"><varname>getPosition</varname></link>: Obtener la fracción de posición

source: <link linkend="startPosition"><varname>startPosition</varname></link>: Get the start position
es: <link linkend="startPosition"><varname>startPosition</varname></link>: Obtener la posición inicial

source: <link linkend="endPosition"><varname>endPosition</varname></link>: Get the end position
es: <link linkend="endPosition"><varname>endPosition</varname></link>: Obtener la posición final

source: <link linkend="npoint_srid"><varname>SRID</varname></link>: Get the spatial reference identifier
es: <link linkend="npoint_srid"><varname>SRID</varname></link>: Obtener el identificador de referencia espacial

source: <link linkend="npoint_geometry"><varname>::</varname></link>: Cast a network point to a geometry
es: <link linkend="npoint_geometry"><varname>::</varname></link>: Convertir un punto de red en una geometría

source: <link linkend="geometry_npoint"><varname>::</varname></link>: Cast a geometry to a network point
es: <link linkend="geometry_npoint"><varname>::</varname></link>: Convertir una geometría en un punto de red

source: <link linkend="npoint_same"><varname>equals</varname></link>: Spatial equality for network points
es: <link linkend="npoint_same"><varname>equals</varname></link>: Igualdad espacial para puntos de red

source: <link linkend="static_eq"><varname>=</varname></link>: Are the values equal?
es: <link linkend="static_eq"><varname>=</varname></link>: ¿Son iguales los valores?

source: <link linkend="static_ne"><varname>&lt;&gt;</varname></link>: Are the values different?
es: <link linkend="static_ne"><varname>&lt;&gt;</varname></link>: ¿Son diferentes los valores?

source: <link linkend="static_lt"><varname>&lt;</varname></link>: Is the first value less than the second one?
es: <link linkend="static_lt"><varname>&lt;</varname></link>: ¿El primer valor es menor que el segundo?

source: <link linkend="static_gt"><varname>&gt;</varname></link>: Is the first value greater than the second one?
es: <link linkend="static_gt"><varname>&gt;</varname></link>: ¿El primer valor es mayor que el segundo?

source: <link linkend="static_le"><varname>&lt;=</varname></link>: Is the first value less than or equal to the second one?
es: <link linkend="static_le"><varname>&lt;=</varname></link>: ¿El primer valor es menor o igual que el segundo?

source: <link linkend="static_ge"><varname>&gt;=</varname></link>: Is the first value greater than or equal to the second one?
es: <link linkend="static_ge"><varname>&gt;=</varname></link>: ¿El primer valor es mayor o igual que el segundo?

source: Temporal Network Points
es: Puntos de red temporales

source: Constructors
es: Constructores

source: <link linkend="tnpoint_inst"><varname>tnpoint_inst</varname></link>: Constructor for temporal network points of instant subtype
es: <link linkend="tnpoint_inst"><varname>tnpoint_inst</varname></link>: Constructor para puntos de red temporal de subtipo instante

source: <link linkend="tnpoint_instset"><varname>tnpoint_instset</varname></link>: Constructors for temporal network points of instant set subtype
es: <link linkend="tnpoint_instset"><varname>tnpoint_instset</varname></link>: Constructor para puntos de red temporal de subtipo conjunto de instantes

source: <link linkend="tnpoint_seq"><varname>tnpoint_seq</varname></link>: Constructor for temporal network points of sequence subtype
es: <link linkend="tnpoint_seq"><varname>tnpoint_seq</varname></link>: Constructor para puntos de red temporal de subtipo secuencia

source: <link linkend="tnpoint_seqset"><varname>tnpoint_seqset</varname></link>: Constructor for temporal network points of sequence set subtype
es: <link linkend="tnpoint_seqset"><varname>tnpoint_seqset</varname></link>: Constructor para puntos de red temporal de subtipo conjunto de secuencias

source: <link linkend="tnpoint_tgeompoint"><varname>tnpoint::tgeompoint</varname></link>: Cast a temporal network point to a temporal geometry point
es: <link linkend="tnpoint_tgeompoint"><varname>::</varname></link>: Convertir un punto de red temporal en un punto de geometría temporal

source: <link linkend="tgeompoint_tnpoint"><varname>tgeompoint::tnpoint</varname></link>: Cast a temporal geometry point to a temporal network point
es: <link linkend="tgeompoint_tnpoint"><varname>::</varname></link>: Convertir un punto de geometría temporal en un punto de red temporal

source: Functions and Operators
es: Funciones y operadores

source: <link linkend="tnpoint_transform"><varname>tnpoint_inst, tnpoint_instset, tnpoint_seq, tnpoint_seqset</varname></link>: Transform a temporal network to another subtype
es: <link linkend="tnpoint_transform"><varname>tnpoint_inst, tnpoint_instset, tnpoint_seq, tnpoint_seqset</varname></link>: Transformar un punto de red temporal en otro subtipo

source: <link linkend="tnpoint_setPrecision"><varname>setPrecision</varname></link>: Set the precision of the fraction of the temporal network point to the number of decimal places
es: <link linkend="tnpoint_setPrecision"><varname>setPrecision</varname></link>: Establecer la precisión de la fracción del punto de red temporal en el número de posiciones decimales

source: <link linkend="tnpoint_getValues"><varname>getValues</varname></link>: Get the values
es: <link linkend="tnpoint_getValues"><varname>getValues</varname></link>: Obtener los valores

source: <link linkend="tnpoint_valueAtTimestamp"><varname>valueAtTimestamp</varname></link>: Get the value at a timestamp
es: <link linkend="tnpoint_valueAtTimestamp"><varname>valueAtTimestamp</varname></link>: Obtener el valor en una marca de tiempo

source: <link linkend="tnpoint_length"><varname>length</varname></link>: Get the length traversed by the temporal network point
es: <link linkend="tnpoint_length"><varname>length</varname></link>: Obtener la longitud atravesada por el punto de red temporal

source: <link linkend="tnpoint_cumulativeLength"><varname>cumulativeLength</varname></link>: Get the cumulative length traversed by the temporal network point
es: <link linkend="tnpoint_cumulativeLength"><varname>cumulativeLength</varname></link>: Obtener la longitud acumulada atravesada por el punto de red temporal

source: <link linkend="tnpoint_speed"><varname>speed</varname></link>: Get the speed of the temporal network point in units per second
es: <link linkend="tnpoint_speed"><varname>speed</varname></link>: Obtener la velocidad del punto de red temporal en unidades por segundo

source: <link linkend="tnpoint_stbox"><varname>stbox</varname></link>: Construct the bounding box from a npoint and, optionally, a timestamp or a period
es: <link linkend="tnpoint_stbox"><varname>stbox</varname></link>: Construir el cuadro delimitador a partir de un punto de red y, opcionalmente, una marca de tiempo o un período

source: <link linkend="tnpoint_twCentroid"><varname>twCentroid</varname></link>: Get the time-weighted centroid
es: <link linkend="tnpoint_twCentroid"><varname>twCentroid</varname></link>: Obtener el centroide ponderado en el tiempo

source: <link linkend="tnpoint_azimuth"><varname>azimuth</varname></link>: Get the temporal azimuth
es: <link linkend="tnpoint_azimuth"><varname>azimuth</varname></link>: Obtener el acimut temporal

source: <link linkend="tnpoint_nearestApproachInstant"><varname>nearestApproachInstant</varname></link>: Get the instant of the first temporal network point at which the two arguments are at the nearest distance
es: <link linkend="tnpoint_nearestApproachInstant"><varname>nearestApproachInstant</varname></link>: Obtener el instante del primer punto de red temporal en el que los dos argumentos están a la distancia más cercana

source: <link linkend="tnpoint_nearestApproachDistance"><varname>nearestApproachDistance</varname></link>: Smallest distance ever between the two arguments
es: <link linkend="tnpoint_nearestApproachDistance"><varname>nearestApproachDistance</varname></link>: Obtener la distancia más pequeña entre los dos argumentos

source: <link linkend="tnpoint_shortestLine"><varname>shortestLine</varname></link>: Get the line connecting the nearest approach point between the two arguments
es: <link linkend="tnpoint_shortestLine"><varname>shortestLine</varname></link>: Obtener la línea que conecta el punto de aproximación más cercano entre los dos argumentos

source: <link linkend="tnpoint_atValue"><varname>atValue</varname></link>: Restrict to a value
es: <link linkend="tnpoint_atValue"><varname>atValue</varname></link>: Restringir a un valor

source: <link linkend="tnpoint_atGeometry"><varname>atGeometry</varname></link>: Restrict to a geometry
es: <link linkend="tnpoint_atGeometry"><varname>atGeometry</varname></link>: Restringir a una geometría

source: <link linkend="tnpoint_minusValue"><varname>minusValue</varname></link>: Difference with a value
es: <link linkend="tnpoint_minusValue"><varname>minusValue</varname></link>: Diferencia con un valor

source: <link linkend="tnpoint_minusGeometry"><varname>minusGeometry</varname></link>: Difference with a geometry
es: <link linkend="tnpoint_minusGeometry"><varname>minusGeometry</varname></link>: Diferencia con una geometría

source: <link linkend="tnpoint_comp"><varname>=, &lt;&gt;, &lt;, &gt;, &lt;=, &gt;=</varname></link>: Traditional comparison operators
es: <link linkend="tnpoint_comp"><varname>=, &lt;&gt;, &lt;, &gt;, &lt;=, &gt;=</varname></link>: Operadores de comparación tradicionales

source: <link linkend="tnpoint_tcomp"><varname>#=, #&lt;&gt;</varname></link>: Temporal comparison operators
es: <link linkend="tnpoint_tcomp"><varname>#=, #&lt;&gt;</varname></link>: Operadores de comparación temporales

source: <link linkend="tnpoint_ever_always"><varname>?=, &amp;=</varname></link>: Ever and always equal operators
es: <link linkend="tnpoint_ever_always"><varname>?=, &amp;=</varname></link>: Operadores de igualdad siempre y alguna vez

source: <link linkend="tnpoint_relpos"><varname>&lt;&lt;, &amp;&lt;, &gt;&gt;, &amp;&gt;, &lt;&lt;|, &amp;&lt;|, |&gt;&gt;, |&amp;&gt;, &lt;&lt;#, &amp;&lt;#, #&gt;&gt;, |&amp;&gt;</varname></link>: Relative position operators
es: <link linkend="tnpoint_relpos"><varname>&lt;&lt;, &amp;&lt;, &gt;&gt;, &amp;&gt;, &lt;&lt;|, &amp;&lt;|, |&gt;&gt;, |&amp;&gt;, &lt;&lt;#, &amp;&lt;#, #&gt;&gt;, |&amp;&gt;</varname></link>: Operadores de posición relativa

source: <link linkend="tnpoint_topo"><varname>&amp;&amp;, &lt;@, @&gt;, ~=, -|-</varname></link>: Topological operators
es: <link linkend="tnpoint_topo"><varname>&amp;&amp;, &lt;@, @&gt;, ~=, -|-</varname></link>: Operadores topológicos

source: <link linkend="tnpoint_smallestDistance"><varname>|=|</varname></link>: Get the smallest distance ever between the two arguments
es: <link linkend="tnpoint_smallestDistance"><varname>|=|</varname></link>: Obtener la distancia más pequeña entre los dos argumentos

source: <link linkend="tnpoint_distance"><varname>&lt;-&gt;</varname></link>: Get the temporal distance
es: <link linkend="tnpoint_distance"><varname>&lt;-&gt;</varname></link>: Obtener la distancia temporal

source: <link linkend="tnpoint_spatialrels"><varname>contains, disjoint, intersects, touches, dwithin</varname></link>: Possible spatial relationships
es: <link linkend="tnpoint_spatialrels"><varname>contains, disjoint, intersects, touches, dwithin</varname></link>: Relaciones espaciales posibles

source: <link linkend="tnpoint_tspatialrels"><varname>tcontains, tdisjoint, tintersects, ttouches, tdwithin</varname></link>: Temporal spatial relationships
es: <link linkend="tnpoint_tspatialrels"><varname>tcontains, tdisjoint, tintersects, ttouches, tdwithin</varname></link>: Relaciones espaciales temporales

source: <link linkend="tnpoint_tcount"><varname>tcount</varname></link>: Temporal count
es: <link linkend="tnpoint_tcount"><varname>tcount</varname></link>: Conteo temporal

source: <link linkend="tnpoint_wcount"><varname>tcount</varname></link>: Window count
es: <link linkend="tnpoint_wcount"><varname>wcount</varname></link>: Conteo de ventana

source: <link linkend="tnpoint_tcentroid"><varname>tcentroid</varname></link>: Temporal centroid
es: <link linkend="tnpoint_tcentroid"><varname>tcentroid</varname></link>: Centroide temporal
