Repository: MobilityDB/MobilityDB
Catalog: doc/*/reference.xml.po
Languages: es

source: <link linkend="stbox_overright"><varname>&amp;&gt;</varname></link>: Are the X values of the first bounding box not to the left of those of the second one?
es: <link linkend="stbox_overright"><varname>&amp;&gt;</varname></link>: ¿No están los valores X del primer cuadro delimitador a la izquierda de los del segundo?

source: <link linkend="stbox_below"><varname>&lt;&lt;|</varname></link>: Are the Y values of the first bounding box strictly below of those of the second one?
es: <link linkend="stbox_below"><varname>&lt;&lt;|</varname></link>: ¿Están los valores de Y del primer cuadro delimitador estrictamente debajo de los del segundo?

source: <link linkend="stbox_above"><varname>|&gt;&gt;</varname></link>: Are the Y values of the first bounding box strictly above of those of the second one?
es: <link linkend="stbox_above"><varname>|&gt;&gt;</varname></link>: ¿Están los valores de Y del primer cuadro delimitador estrictamente arriba de los del segundo?

source: <link linkend="stbox_overbelow"><varname>&amp;&lt;|</varname></link>: Are the Y values of the first bounding box not above of those of the second one?
es: <link linkend="stbox_overbelow"><varname>&amp;&lt;|</varname></link>: ¿No están los valores de Y del primer cuadro delimitador debajo de los del segundo?

source: <link linkend="stbox_overabove"><varname>|&amp;&gt;</varname></link>: Are the Y values of the first bounding box not below of those of the second one?
es: <link linkend="stbox_overabove"><varname>|&amp;&gt;</varname></link>: ¿No están los valores de Y del primer cuadro delimitador debajo de los del segundo?

source: <link linkend="stbox_front"><varname>&lt;&lt;/</varname></link>: Are the Z values of the first bounding box strictly in front of those of the second one?
es: <link linkend="stbox_front"><varname>&lt;&lt;/</varname></link>: ¿Están los valores Z del primer cuadro delimitador estrictamente delante de los del segundo?

source: <link linkend="stbox_back"><varname>/&gt;&gt;</varname></link>: Are the Z values of the first bounding box strictly back of those of the second one?
es: <link linkend="stbox_back"><varname>/&gt;&gt;</varname></link>: ¿Están los valores Z del primer cuadro delimitador estrictamente detrás de los del segundo?

source: <link linkend="stbox_overfront"><varname>&amp;&lt;/</varname></link>: Are the Z values of the first bounding box not back of those of the second one?
es: <link linkend="stbox_overfront"><varname>&amp;&lt;/</varname></link>: ¿No están los valores Z del primer cuadro delimitador detrás de los del segundo?

source: <link linkend="stbox_overback"><varname>/&amp;&gt;</varname></link>: Are the Z values of the first bounding box not in front of those of the second one?
es: <link linkend="stbox_overback"><varname>/&amp;&gt;</varname></link>: ¿No están los valores Z del primer cuadro delimitador delante de los del segundo?

source: <link linkend="box_before"><varname>&lt;&lt;#</varname></link>: Are the T values of the first bounding box strictly before those of the second one?
es: <link linkend="box_before"><varname>&lt;&lt;#</varname></link>: ¿Son los valores de T del primer cuadro delimitador estrictamente anteriores a los del segundo?

source: <link linkend="box_after"><varname>#&gt;&gt;</varname></link>: Are the T values of the first bounding box strictly after those of the second one?
es: <link linkend="box_after"><varname>#&gt;&gt;</varname></link>: ¿Son los valores de T del primer cuadro delimitador estrictamente posteriores a los del segundo?

source: <link linkend="box_overbefore"><varname>&amp;&lt;#</varname></link>: Are the T values of the first bounding box not after those of the second one?
es: <link linkend="box_overbefore"><varname>&amp;&lt;#</varname></link>: ¿No son los valores de T del primer cuadro delimitador posteriores a los del segundo?

source: <link linkend="box_overafter"><varname>#&amp;&gt;</varname></link>: Are the T values of the first bounding box not before those of the second one?
es: <link linkend="box_overafter"><varname>#&amp;&gt;</varname></link>: ¿No son los valores de T del primer cuadro delimitador anteriores a los del segundo?

source: Functions and Operators for Temporal Types
es: Funciones y operadores para tipos temporales

source: <link linkend="ttype_inst"><varname>ttype_inst</varname></link>: Constructor for temporal types of instant subtype
es: <link linkend="ttype_inst"><varname>ttype_inst</varname></link>: Constructor para tipos temporales de subtipo instante

source: <link linkend="ttype_instset"><varname>ttype_instset</varname></link>: Constructor for temporal types of instant set subtype
es: <link linkend="ttype_instset"><varname>ttype_instset</varname></link>: Constructor para tipos temporales de subtipo conjunto de instantes

source: <link linkend="ttype_seq"><varname>ttype_seq</varname></link>: Constructor for temporal types of sequence subtype
es: <link linkend="ttype_seq"><varname>ttype_seq</varname></link>: Constructor para tipos temporales de subtipo secuencia

source: <link linkend="ttype_seqset"><varname>ttype_seqset</varname></link>: Constructor for temporal types of sequence set subtype
es: <link linkend="ttype_seqset"><varname>ttype_seqset</varname></link>: Constructor para tipos temporales de subtipo conjunto de secuencias

source: <link linkend="temporal_period"><varname>ttype::period</varname></link>: Cast a temporal value to a period
es: <link linkend="temporal_period"><varname>ttype::period</varname></link>: Convertir un valor temporal a un período

source: <link linkend="tnumber_range"><varname>tnumber::range</varname></link>: Cast a temporal number to a range
es: <link linkend="tnumber_range"><varname>tnumber::range</varname></link>: Convertir un número temporal a un rango

source: <link linkend="tnumber_tbox"><varname>tnumber::tbox</varname></link>: Cast a temporal number to a <varname>tbox</varname>
es: <link linkend="tnumber_tbox"><varname>tnumber::tbox</varname></link>: Convertir un número temporal number a un <varname>tbox</varname>

source: <link linkend="tpoint_stbox"><varname>ttype::period</varname></link>: Cast a temporal point to an <varname>stbox</varname>
es: <link linkend="tpoint_stbox"><varname>tpoint::stbox</varname></link>: Convertir un punto temporal a un <varname>stbox</varname>

source: <link linkend="tint_tfloat"><varname>tint::tfloat</varname></link>: Cast a temporal integer to a temporal float
es: <link linkend="tint_tfloat"><varname>tint::tfloat</varname></link>: Convertir un entero temporal en un flotante temporal

source: <link linkend="tfloat_tint"><varname>tfloat::tint</varname></link>: Cast a temporal float to a temporal integer
es: <link linkend="tfloat_tint"><varname>tfloat::tint</varname></link>: Convertir un flotante temporal en un entero temporal

source: <link linkend="tgeompoint_tgeogpoint"><varname>tgeompoint::tgeogpoint</varname></link>: Cast a temporal geometry point to a temporal geography point
es: <link linkend="tgeompoint_tgeogpoint"><varname>tgeompoint::tgeogpoint</varname></link>: Convertir un punto geométrico temporal en un punto geográfico temporal

source: <link linkend="tgeogpoint_tgeompoint"><varname>tgeogpoint::tgeompoint</varname></link>: Cast a temporal geography point to a temporal geometry point
es: <link linkend="tgeogpoint_tgeompoint"><varname>tgeogpoint::tgeompoint</varname></link>: Convertir un punto geográfico temporal en un punto geométrico temporal

source: <link linkend="tgeompoint_geometry"><varname>tgeompoint::geometry, tgeogpoint::geography</varname></link>: Cast a temporal point to a PostGIS trajectory
es: <link linkend="tgeompoint_geometry"><varname>tgeompoint::geometry, tgeogpoint::geography</varname></link>: Convertir un punto temporal en una trayectoria PostGIS

source: <link linkend="geometry_tgeompoint"><varname>geometry::tgeompoint, geography::tgeogpoint</varname></link>: Cast a PostGIS trajectory to a temporal point
es: <link linkend="geometry_tgeompoint"><varname>geometry::tgeompoint, geography::tgeogpoint</varname></link>: Convertir una trayectoria PostGIS en un punto temporal

source: Transformation Functions
es: Funciones de transformación

source: <link linkend="ttype_transform"><varname>ttype_inst, ttype_instset, ttype_seq, ttype_seqset</varname></link>: Transform a temporal value to another subtype
es: <link linkend="ttype_transform"><varname>ttype_inst, ttype_instset, ttype_seq, ttype_seqset</varname></link>: Transformar un valor temporal en otro subtipo

source: <link linkend="toLinear"><varname>toLinear</varname></link>: Transform a temporal value with continuous base type from stepwise to linear interpolation
es: <link linkend="toLinear"><varname>toLinear</varname></link>: Transformar un valor temporal con tipo de base continuo de interpolación escalonada a lineal

source: <link linkend="appendInstant"><varname>appendInstant</varname></link>: Append a temporal instant to a temporal value
es: <link linkend="appendInstant"><varname>appendInstant</varname></link>: Anexar un instante temporal a un valor temporal

source: <link linkend="merge"><varname>merge</varname></link>: Merge temporal values
es: <link linkend="merge"><varname>merge</varname></link>: Fusionar los valores temporales

source: <link linkend="ttype_memSize"><varname>memSize</varname></link>: Get the memory size in bytes
es: <link linkend="ttype_memSize"><varname>memSize</varname></link>: Obtener el tamaño de la memoria en bytes

source: <link linkend="tempSubtype"><varname>tempSubtype</varname></link>: Get the temporal subtype
es: <link linkend="tempSubtype"><varname>tempSubtype</varname></link>: Obtener el subtipo temporal

source: <link linkend="interpolation"><varname>interpolation</varname></link>: Get the interpolation
es: <link linkend="interpolation"><varname>interpolation</varname></link>: Obtener la interpolación

source: <link linkend="getValue"><varname>getValue</varname></link>: Get the value
es: <link linkend="getValue"><varname>getValue</varname></link>: Obtener el valor

source: <link linkend="getValues"><varname>getValues</varname></link>: Get the values
es: <link linkend="getValues"><varname>getValues</varname></link>: Obtener los valores

source: <link linkend="startValue"><varname>startValue</varname></link>: Get the start value
es: <link linkend="startValue"><varname>startValue</varname></link>: Obtener el valor inicial

source: <link linkend="endValue"><varname>endValue</varname></link>: Get the end value
es: <link linkend="endValue"><varname>endValue</varname></link>: Obtener el valor final

source: <link linkend="minValue"><varname>minValue</varname></link>: Get the minimum value
es: <link linkend="minValue"><varname>minValue</varname></link>: Obtener el valor mínimo

source: <link linkend="maxValue"><varname>maxValue</varname></link>: Get the maximum value
es: <link linkend="maxValue"><varname>maxValue</varname></link>: Obtener el valor máximo

source: <link linkend="valueRange"><varname>valueRange</varname></link>: Get the value range
es: <link linkend="valueRange"><varname>valueRange</varname></link>: Obtener el rango de valores

source: <link linkend="valueAtTimestamp"><varname>valueAtTimestamp</varname></link>: Get the value at a timestamp
es: <link linkend="valueAtTimestamp"><varname>valueAtTimestamp</varname></link>: Obtener el valor en una marca de tiempo

source: <link linkend="getTimestamp"><varname>getTimestamp</varname></link>: Get the timestamp
es: <link linkend="getTimestamp"><varname>getTimestamp</varname></link>: Obtener la marca de tiempo

source: <link linkend="getTime"><varname>getTime</varname></link>: Get the time
es: <link linkend="getTime"><varname>getTime</varname></link>: Obtener el tiempo

source: <link linkend="ttype_duration"><varname>duration</varname></link>: Get the duration
es: <link linkend="ttype_duration"><varname>duration</varname></link>: Obtener el intervalo de tiempo

source: <link linkend="ttype_timespan"><varname>timespan</varname></link>: Get the timespan ignoring the potential time gaps
es: <link linkend="ttype_timespan"><varname>timespan</varname></link>: Obtener el intervalo de tiempo ignorando las posibles brechas de tiempo

source: <link linkend="ttype_period"><varname>period</varname></link>: Get the period on which the temporal value is defined ignoring the potential time gaps
es: <link linkend="ttype_period"><varname>period</varname></link>: Obtener el período en el que está definido el valor temporal ignorando las posibles brechas de tiempo

source: <link linkend="numInstants"><varname>numInstants</varname></link>: Get the number of different instants
es: <link linkend="numInstants"><varname>numInstants</varname></link>: Obtener el número de instantes diferentes

source: <link linkend="startInstant"><varname>startInstant</varname></link>: Get the start instant
es: <link linkend="startInstant"><varname>startInstant</varname></link>: Obtener el instante inicial

source: <link linkend="endInstant"><varname>endInstant</varname></link>: Get the end instant
es: <link linkend="endInstant"><varname>endInstant</varname></link>: Obtener el instante final

source: <link linkend="instantN"><varname>instantN</varname></link>: Get the n-th different instant
es: <link linkend="instantN"><varname>instantN</varname></link>: Obtener el enésimo instante diferente

source: <link linkend="instants"><varname>instants</varname></link>: Get the different instants
es: <link linkend="instants"><varname>instants</varname></link>: Obtener los instantes diferentes

source: <link linkend="ttype_numTimestamps"><varname>numTimestamps</varname></link>: Get the number of different timestamps
es: <link linkend="ttype_numTimestamps"><varname>numTimestamps</varname></link>: Obtener el número de marcas de tiempo diferentes

source: <link linkend="ttype_startTimestamp"><varname>startTimestamp</varname></link>: Get the start timestamp
es: <link linkend="ttype_startTimestamp"><varname>startTimestamp</varname></link>: Obtener la marca de tiempo inicial

source: <link linkend="ttype_endTimestamp"><varname>endTimestamp</varname></link>: Get the end timestamp
es: <link linkend="ttype_endTimestamp"><varname>endTimestamp</varname></link>: Obtener la marca de tiempo final

source: <link linkend="ttype_timestampN"><varname>timestampN</varname></link>: Get the n-th different timestamp
es: <link linkend="ttype_timestampN"><varname>timestampN</varname></link>: Obtener la enésima marca de tiempo diferente

source: <link linkend="ttype_timestamps"><varname>timestamps</varname></link>: Get the different timestamps
es: <link linkend="ttype_timestamps"><varname>timestamps</varname></link>: Obtener las marcas de tiempo diferentes

source: <link linkend="numSequences"><varname>numSequences</varname></link>: Get the number of sequences
es: <link linkend="numSequences"><varname>numSequences</varname></link>: Obtener el número de secuencias

source: <link linkend="startSequence"><varname>startSequence</varname></link>: Get the start sequence
es: <link linkend="startSequence"><varname>startSequence</varname></link>: Obtener la secuencia inicial

source: <link linkend="endSequence"><varname>endSequence</varname></link>: Get the end sequence
es: <link linkend="endSequence"><varname>endSequence</varname></link>: Obtener la secuencia final

source: <link linkend="sequenceN"><varname>sequenceN</varname></link>: Get the n-th sequence
es: <link linkend="sequenceN"><varname>sequenceN</varname></link>: Obtener la enésima secuencia

source: <link linkend="sequences"><varname>sequences</varname></link>: Get the sequences
es: <link linkend="sequences"><varname>sequences</varname></link>: Obtener las secuencias

source: <link linkend="segments"><varname>segments</varname></link>: Get the segments
es: <link linkend="segments"><varname>segments</varname></link>: Obtener los segmentos

source: <link linkend="shift"><varname>shift</varname></link>: Shift the time span of the temporal value by an interval
es: <link linkend="shift"><varname>shift</varname></link>: Desplazar el intervalo de tiempo del valor temporal con un intervalo

source: <link linkend="tscale"><varname>tscale</varname></link>: Scale the time span of the temporal value to an interval
es: <link linkend="tscale"><varname>tscale</varname></link>: Escalear el intervalo de tiempo del valor temporal a un intervalo.

source: <link linkend="shiftTscale"><varname>shiftTscale</varname></link>: Shift and scale the time span the temporal value with the intervals
es: <link linkend="shiftTscale"><varname>shiftTscale</varname></link>: Desplazar y escalear el intervalo de tiempo del valor temporal a los dos intervalos.

source: <link linkend="intersectsTimestamp"><varname>intersectsTimestamp</varname></link>: Does the temporal value intersect the timestamp?
es: <link linkend="intersectsTimestamp"><varname>intersectsTimestamp</varname></link>: ¿Se cruza el valor temporal con la marca de tiempo?

source: <link linkend="intersectsTimestampSet"><varname>intersectsTimestampSet</varname></link>: Does the temporal value intersect the timestamp set?
es: <link linkend="intersectsTimestampSet"><varname>intersectsTimestampSet</varname></link>: ¿Se cruza el valor temporal con el conjunto de marcas tiempo?

source: <link linkend="intersectsPeriod"><varname>intersectsPeriod</varname></link>: Does the temporal value intersect the period?
es: <link linkend="intersectsPeriod"><varname>intersectsPeriod</varname></link>: ¿Se cruza el valor temporal con el período?

source: <link linkend="intersectsPeriodSet"><varname>intersectsPeriodSet</varname></link>: Does the temporal value intersect the period set?
es: <link linkend="intersectsPeriodSet"><varname>intersectsPeriodSet</varname></link>: ¿Se cruza el valor temporal con el conjunto de períodos?

source: <link linkend="twAvg"><varname>twAvg</varname></link>: Get the time-weighted average
es: <link linkend="twAvg"><varname>twAvg</varname></link>: Obtener el promedio ponderado en el tiempo

source: Spatial Functions
es: Funciones espaciales

source: <link linkend="asText"><varname>asText</varname></link>: Get the Well-Known Text (WKT) representation
es: <link linkend="asText"><varname>asText</varname></link>: Obtener la representación de texto conocido (Well-Known Text o WKT)

source: <link linkend="asEWKT"><varname>asEWKT</varname></link>: Get the Extended Well-Known Text (EWKT) representation
es: <link linkend="asEWKT"><varname>asEWKT</varname></link>: Obtener la representación extendida de texto conocido (Extended Well-Known Text o EWKT)

source: <link linkend="asMFJSON"><varname>asMFJSON</varname></link>: Get the Moving Features JSON representation
es: <link linkend="asMFJSON"><varname>asMFJSON</varname></link>: Obtener la representación JSON de características móviles (Moving Features)

source: <link linkend="asBinary"><varname>asBinary</varname></link>: Get the Well-Known Binary (WKB) representation
es: <link linkend="asBinary"><varname>asBinary</varname></link>: Obtener la representación binaria conocida (Well-Known Binary o WKB)

source: <link linkend="asEWKB"><varname>asEWKB</varname></link>: Get the Extended Well-Known Binary (EWKB) representation
es: <link linkend="asEWKB"><varname>asEWKB</varname></link>: Obtener la representación extendida binaria conocida (Extended Well-Known Binary o EWKB)

source: <link linkend="asHexEWKB"><varname>asHexEWKB</varname></link>: Get the Hexadecimal Extended Well-Known Binary (EWKB) representation as text
es: <link linkend="asHexEWKB"><varname>asHexEWKB</varname></link>: Obtener la representación hexadecimal extendida binaria conocida (Hexadecimal Extended Well-Known Binary o EWKB) en formato texto

source: <link linkend="tgeompointFromText"><varname>tgeompointFromText</varname></link>: Input a temporal geometry point from a Well-Known Text (WKT) representation
es: <link linkend="tgeompointFromText"><varname>tgeompointFromText</varname></link>: Entrar un punto temporal geométrico en representación de texto conocido (Well-Known Text o WKT)

source: <link linkend="tgeogpointFromText"><varname>tgeogpointFromText</varname></link>: Input a temporal geography point from a Well-Known Text (WKT) representation
es: <link linkend="tgeogpointFromText"><varname>tgeogpointFromText</varname></link>: Entrar un punto temporal geográfico en representación de texto conocido (Well-Known Text o WKT)

source: <link linkend="tgeompointFromEWKT"><varname>tgeompointFromEWKT</varname></link>: Input a temporal geometry point from an Extended Well-Known Text (EWKT) representation
es: <link linkend="tgeompointFromEWKT"><varname>tgeompointFromEWKT</varname></link>: Entrar un punto temporal geométrico en representación extendida de texto conocido (Extended Well-Known Text o EWKT)

source: <link linkend="tgeogpointFromEWKT"><varname>tgeogpointFromEWKT</varname></link>: Input a temporal geography point from an Extended Well-Known Text (EWKT) representation
es: <link linkend="tgeogpointFromEWKT"><varname>tgeogpointFromEWKT</varname></link>: Entrar un punto temporal geográfico en representación extendida de texto conocido (Extended Well-Known Text o EWKT)

source: <link linkend="tgeompointFromMFJSON"><varname>tgeompointFromMFJSON</varname></link>: Input a temporal geometry point from a Moving Features JSON representation
es: <link linkend="tgeompointFromMFJSON"><varname>tgeompointFromMFJSON</varname></link>: Entrar un punto temporal geométrico en una representación JSON de características móviles (Moving Features)

source: <link linkend="tgeogpointFromMFJSON"><varname>tgeogpointFromMFJSON</varname></link>: Input a temporal geography geometry point from a Moving Features JSON representation
es: <link linkend="tgeogpointFromMFJSON"><varname>tgeogpointFromMFJSON</varname></link>: Entrar un punto temporal geográfico en una representación JSON de características móviles (Moving Features)

source: <link linkend="tgeompointFromBinary"><varname>tgeompointFromBinary</varname></link>: Input a temporal geometry point from a Well-Known Binary (WKB) representation
es: <link linkend="tgeompointFromBinary"><varname>tgeompointFromBinary</varname></link>: Entrar un punto temporal geométrico en representación binaria conocida (Well-Known Binary o WKB)

source: <link linkend="tgeogpointFromBinary"><varname>tgeogpointFromBinary</varname></link>: Input a temporal geography point from a Well-Known Binary (WKB) representation
es: <link linkend="tgeogpointFromBinary"><varname>tgeogpointFromBinary</varname></link>: Entrar un punto temporal geográfico en representación binaria conocida (Well-Known Binary o WKB)

source: <link linkend="tgeompointFromEWKB"><varname>tgeompointFromEWKB</varname></link>: Input a temporal geometry point from an Extended Well-Known Binary (EWKB) representation
es: <link linkend="tgeompointFromEWKB"><varname>tgeompointFromEWKB</varname></link>: Entrar un punto temporal geométrico en una representación extendida binaria conocida (Extended Well-Known Binary o EWKB)

source: <link linkend="tgeogpointFromEWKB"><varname>tgeogpointFromEWKB</varname></link>: Input a temporal geography point from an Extended Well-Known Binary (EWKB) representation
es: <link linkend="tgeogpointFromEWKB"><varname>tgeogpointFromEWKB</varname></link>: Entrar un punto temporal geográfico en una representación extendida binaria conocida (Extended Well-Known Binary o EWKB)

source: <link linkend="tgeompointFromHexEWKB"><varname>tgeompointFromHexEWKB</varname></link>: Input a temporal geometry point from an Hexadecimal Extended Well-Known Binary (EWKB) representation as text
es: <link linkend="tgeompointFromHexEWKB"><varname>tgeompointFromHexEWKB</varname></link>: Entrar un punto temporal geométrico en representación hexadecimal extendida binaria conocida (Hexadecimal Extended Well-Known Binary o EWKB) en formato texto
