Repository: MobilityDB/MobilityDB
Catalog: doc/*/temporal_types.po
Languages: es

source: CREATE TABLE Trips(CarId integer, TripId integer, Trip tgeompoint); INSERT INTO Trips VALUES (10, 1, tgeompoint '{[Point(0 0)@2012-01-01 08:00:00, Point(2 0)@2012-01-01 08:10:00, Point(2 1)@2012-01-01 08:15:00)}'), (20, 1, tgeompoint '{[Point(0 0)@2012-01-01 08:05:00, Point(1 1)@2012-01-01 08:10:00, Point(3 3)@2012-01-01 08:20:00)}'); -- Value at a given timestamp SELECT CarId, ST_AsText(valueAtTimestamp(Trip, timestamptz '2012-01-01 08:10:00')) FROM Trips; -- 10;"POINT(2 0)" 20;"POINT(1 1)" -- Restriction to a given value SELECT CarId, asText(atValue(Trip, 'Point(2 0)')) FROM Trips; -- 10;"{"[POINT(2 0)@2012-01-01 08:10:00+00]"}" 20; NULL -- Restriction to a period SELECT CarId, asText(atPeriod(Trip, '[2012-01-01 08:05:00,2012-01-01 08:10:00]')) FROM Trips; -- 10;"{[POINT(1 0)@2012-01-01 08:05:00+00, POINT(2 0)@2012-01-01 08:10:00+00]}" 20;"{[POINT(0 0)@2012-01-01 08:05:00+00, POINT(1 1)@2012-01-01 08:10:00+00]}" -- Temporal distance SELECT T1.CarId, T2.CarId, T1.Trip &lt;-&gt; T2.Trip FROM Trips T1, Trips T2 WHERE T1.CarId &lt; T2.CarId; -- 10;20;"{[1@2012-01-01 08:05:00+00, 1.4142135623731@2012-01-01 08:10:00+00, 1@2012-01-01 08:15:00+00)}"
es: CREATE TABLE Trips(CarId integer, TripId integer, Trip tgeompoint); INSERT INTO Trips VALUES (10, 1, tgeompoint '{[Point(0 0)@2012-01-01 08:00:00, Point(2 0)@2012-01-01 08:10:00, Point(2 1)@2012-01-01 08:15:00)}'), (20, 1, tgeompoint '{[Point(0 0)@2012-01-01 08:05:00, Point(1 1)@2012-01-01 08:10:00, Point(3 3)@2012-01-01 08:20:00)}'); -- Valor en una marca de tiempo SELECT CarId, ST_AsText(valueAtTimestamp(Trip, timestamptz '2012-01-01 08:10:00')) FROM Trips; -- 10;"POINT(2 0)" 20;"POINT(1 1)" -- Restricción a un valor SELECT CarId, asText(atValue(Trip, 'Point(2 0)')) FROM Trips; -- 10;"{"[POINT(2 0)@2012-01-01 08:10:00+00]"}" 20; NULL -- Restricción a un período SELECT CarId, asText(atPeriod(Trip, '[2012-01-01 08:05:00,2012-01-01 08:10:00]')) FROM Trips; -- 10;"{[POINT(1 0)@2012-01-01 08:05:00+00, POINT(2 0)@2012-01-01 08:10:00+00]}" 20;"{[POINT(0 0)@2012-01-01 08:05:00+00, POINT(1 1)@2012-01-01 08:10:00+00]}" -- Distancia temporal SELECT T1.CarId, T2.CarId, T1.Trip &lt;-&gt; T2.Trip FROM Trips T1, Trips T2 WHERE T1.CarId &lt; T2.CarId; -- 10;20;"{[1@2012-01-01 08:05:00+00, 1.4142135623731@2012-01-01 08:10:00+00, 1@2012-01-01 08:15:00+00)}"

source: Validity of Temporal Types
es: Validez de los tipos temporales

source: Values of temporal types must satisfy several constraints so that they are well defined. These constraints are given next.
es: Los valores de los tipos temporales deben satisfacer varias restricciones para que estén bien definidos. Estas restricciones se dan a continuación.

source: The constraints on the base type and the <varname>timestamptz</varname> type must be satisfied.
es: Las restricciones en el tipo base y el tipo <varname>timestamptz</varname> deben satisfacerse.

source: A sequence value must be composed of at least one instant value.
es: Un valor de secuencia debe estar compuesto por al menos un valor de instante.

source: An instantaneous sequence value must have inclusive lower and upper bounds.
es: Un valor de secuencia instantánea debe tener límites superior e inferior inclusivos.

source: In a sequence value, the timestamps of the composing instants must be different and ordered.
es: En un valor de secuencia, las marcas de tiempo de los instantes que la componen deben ser diferentes y estar ordenadas.

source: In a sequence value with stepwise interpolation, the last two values must be equal if upper bound is exclusive.
es: En un valor de secuencia con interpolación escalonada, los dos últimos valores deben ser iguales si el límite superior es exclusivo.

source: A set value must be composed of at least one unit value.
es: Un valor de conjunto debe estar compuesto por al menos un valor unitario.

source: In an instant set value, the composing instants must be different and ordered. This implies that the temporal extent of an instant set value is an ordered set of <varname>timestamptz</varname> values without duplicates.
es: En un valor de conjunto de instantes, los instantes que lo componen deben ser diferentes y ordenados. Esto implica que la extensión temporal de un valor de conjunto de instantes es un conjunto ordenado de valores de <varname>timestamptz</varname> sin duplicados.

source: In a sequence set value, the composing sequence values must be non overlapping and ordered. This implies that the temporal extent of a sequence set value is an ordered set of disjoint periods.
es: En un valor de conjunto de secuencias, los valores de las secuencias componentes no deben superponerse y deben estar ordenados. Esto implica que la extensión temporal de un valor de conjunto de secuencias es un conjunto ordenado de períodos disjuntos.

source: An error is raised whenever one of these constraints are not satisfied. Examples of incorrect temporal values are as follows.
es: Se genera un error cuando no se satisface una de estas restricciones. Ejemplos de valores temporales incorrectos son los siguientes.

source: -- Incorrect value for base type SELECT tbool '1.5@2001-01-01 08:00:00'; -- Base type value is not a point SELECT tgeompoint 'Linestring(0 0,1 1)@2001-01-01 08:05:00'; -- Incorrect timestamp SELECT tint '2@2001-02-31 08:00:00'; -- Empty sequence SELECT tint ''; -- Incorrect bounds for instantaneous sequence SELECT tint '[1@2001-01-01 09:00:00)'; -- Duplicate timestamps SELECT tint '[1@2001-01-01 08:00:00, 2@2001-01-01 08:00:00]'; -- Unordered timestamps SELECT tint '[1@2001-01-01 08:10:00, 2@2001-01-01 08:00:00]'; -- Incorrect end value SELECT tint '[1@2001-01-01 08:00:00, 2@2001-01-01 08:10:00)'; -- Empty sequence set SELECT tints(ARRAY[]); -- Duplicate timestamps SELECT tinti(ARRAY[tint '1@2001-01-01 08:00:00', '2@2001-01-01 08:00:00']); -- Overlapping periods SELECT tints(ARRAY[tint '[1@2001-01-01 08:00:00, 1@2001-01-01 10:00:00)', '[2@2001-01-01 09:00:00, 2@2001-01-01 11:00:00)']);
es: -- Valor del tipo de base incorrecto SELECT tbool '1.5@2001-01-01 08:00:00'; -- Valor del tipo base no es un punto SELECT tgeompoint 'Linestring(0 0,1 1)@2001-01-01 08:05:00'; -- Marca de tiempo incorrecta SELECT tint '2@2001-02-31 08:00:00'; -- Secuencia vacía SELECT tint ''; -- Límites incorrectos para la secuencia instantánea SELECT tint '[1@2001-01-01 09:00:00)'; -- Marcas de tiempo duplicadas SELECT tint '[1@2001-01-01 08:00:00, 2@2001-01-01 08:00:00]'; -- Marcas de tiempo desordenadas SELECT tint '[1@2001-01-01 08:10:00, 2@2001-01-01 08:00:00]'; -- Valor final incorrecto SELECT tint '[1@2001-01-01 08:00:00, 2@2001-01-01 08:10:00)'; -- Conjunto de secuencias vacío SELECT tints(ARRAY[]); -- Marcas de tiempo duplicadas SELECT tinti(ARRAY[tint '1@2001-01-01 08:00:00', '2@2001-01-01 08:00:00']); -- Períodos superpuestos SELECT tints(ARRAY[tint '[1@2001-01-01 08:00:00, 1@2001-01-01 10:00:00)', '[2@2001-01-01 09:00:00, 2@2001-01-01 11:00:00)']);
