/*****************************************************************************
 * Tbox
 *****************************************************************************/
SELECT tbox 'GBOX((1.0, 2.0), (1.0, 2.0))';
ERROR:  Could not parse TBOX
LINE 4: SELECT tbox 'GBOX((1.0, 2.0), (1.0, 2.0))';
                    ^
/* Errors */
SELECT tbox '(1, 2)';
ERROR:  Could not parse TBOX
LINE 2: SELECT tbox '(1, 2)';
                    ^
SELECT tbox '((AA, 2))';
ERROR:  Could not parse TBOX
LINE 1: SELECT tbox '((AA, 2))';
                    ^
SELECT tbox '((1, AA))';
ERROR:  Could not parse TBOX
LINE 1: SELECT tbox '((1, AA))';
                    ^
SELECT tbox '((1, 2, 3))';
ERROR:  Could not parse TBOX
LINE 1: SELECT tbox '((1, 2, 3))';
                    ^
SELECT tbox '((1, 2),(AA, 4))';
ERROR:  Could not parse TBOX
LINE 1: SELECT tbox '((1, 2),(AA, 4))';
                    ^
SELECT tbox '((1, 2),(3, AA))';
ERROR:  Could not parse TBOX
LINE 1: SELECT tbox '((1, 2),(3, AA))';
                    ^
SELECT tbox '((1, 2),(3, 4)';
ERROR:  Could not parse TBOX
LINE 1: SELECT tbox '((1, 2),(3, 4)';
                    ^
SELECT tbox(1,2,3,4);
     tbox      
---------------
 ((1,3),(2,4))
(1 row)

SELECT tbox(4,3,2,1);
     tbox      
---------------
 ((3,1),(4,2))
(1 row)

SELECT tbox_cmp(tbox '((1.0, 2.0), (1.0, 2.0))', tbox '((2.0, 2.0), (1.0, 2.0))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox '((2.0, 2.0), (1.0, 2.0))', tbox '((1.0, 2.0), (1.0, 2.0))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox '((1.0, 2.0), (1.0, 2.0))', tbox '((1.0, 3.0), (1.0, 2.0))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox '((1.0, 3.0), (1.0, 2.0))', tbox '((1.0, 2.0), (1.0, 2.0))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox '((1.0, 2.0), (1.0, 2.0))', tbox '((1.0, 2.0), (2.0, 2.0))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox '((1.0, 2.0), (2.0, 2.0))', tbox '((1.0, 2.0), (1.0, 2.0))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox '((1.0, 2.0), (1.0, 2.0))', tbox '((1.0, 2.0), (1.0, 3.0))');
 tbox_cmp 
----------
       -1
(1 row)

SELECT tbox_cmp(tbox '((1.0, 2.0), (1.0, 3.0))', tbox '((1.0, 2.0), (1.0, 2.0))');
 tbox_cmp 
----------
        1
(1 row)

SELECT tbox_cmp(tbox '((1.0, 2.0), (1.0, 2.0))', tbox '((1.0, 2.0), (1.0, 2.0))');
 tbox_cmp 
----------
        0
(1 row)

SELECT tbox '((1.0, 2.0), (1.0, 2.0))' = floatrange '[1, 2]'::tbox;
 ?column? 
----------
 f
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b = t2.b;
 count 
-------
    99
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b <> t2.b;
 count 
-------
  9702
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b < t2.b;
 count 
-------
  4851
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b <= t2.b;
 count 
-------
  4950
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b > t2.b;
 count 
-------
  4851
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b >= t2.b;
 count 
-------
  4950
(1 row)

SELECT count(*) FROM tbl_tfloat WHERE temp::tbox IS NOT NULL;
 count 
-------
    96
(1 row)

SELECT count(*) FROM tbl_tfloat WHERE temp::tbox IS NOT NULL;
 count 
-------
    96
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b && t2.b;
 count 
-------
   215
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b @> t2.b;
 count 
-------
   107
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b <@ t2.b;
 count 
-------
   107
(1 row)

SELECT count(*) FROM tbl_tbox t1, tbl_tbox t2 where t1.b ~= t2.b;
 count 
-------
    99
(1 row)

/*****************************************************************************/
